[
  {
    "id": "PS11752778-install",
    "part_number": "PS11752778",
    "title": "Upper Rack Adjuster Kit W10712395",
    "url": "https://www.partselect.com/PS11752778-Whirlpool-W10712395-Upper-Rack-Adjuster-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Installation is tool-free—simply align and snap into place. Verify your refrigerator’s model number before ordering to ensure compatibility, as dimensions may vary slightly. Restore your refrigerator's storage capacity and organization with this high-quality replacement door bin."
  },
  {
    "id": "PS10065979-install",
    "part_number": "PS10065979",
    "title": "Upper Rack Adjuster Kit W10712395",
    "url": "https://www.partselect.com/PS10065979-Whirlpool-W10712395-Upper-Rack-Adjuster-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This authentic Dishwasher Upper Rack Adjuster Kit with white wheels is a kit made up of primarily plastic and metal components, which will require a screwdriver to install. This kit comes with all the necessary parts for a dishwasher rack adjuster. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. In many cases, our customers have reported the top rack of their dishwasher hanging down or sagging due to the adjuster kit, particularly if the wheels, have broken or failed. If you are having problems in this area, this kit will help get your dishwasher back up and running. Check your model number and user manual to see if this part is right for you. The parts for this kit come as a package and are not generally sold individually."
  },
  {
    "id": "PS11756150-install",
    "part_number": "PS11756150",
    "title": "Dishwasher Upper Rack Adjuster WPW10546503",
    "url": "https://www.partselect.com/PS11756150-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This OEM Dishwasher Upper Rack Adjuster is a grayish-black, plastic part which will require a screwdriver to install. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. The installation has been rated as \"easy\" by customers. Before beginning any repair, you should unplug the dishwasher and wear gloves to protect your hands. Check your model number and user manual to see if this part is right for you! Your dishwasher should have a left and right upper rack adjuster, and both are the same part. These parts are sold individually, so if you are looking to replace both, you will need to order two parts."
  },
  {
    "id": "PS11746591-install",
    "part_number": "PS11746591",
    "title": "Dishwasher Rack Track Stop WP8565925",
    "url": "https://www.partselect.com/PS11746591-Whirlpool-WP8565925-Dishwasher-Rack-Track-Stop.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The rack track stop on your dishwasher is designed to stop the dish rack at the appropriate place when opening and closing the rack. If your dishwasher is not cleaning your dishes properly, the rack stop may need to be replaced. The replacement part may differ slightly from the broken part, depending on the model. However, the different styles are interchangeable. This product is sold individually and comes in both a white and grey plastic version. Many of our customers found this repair to be very easy and takes less than 30 minutes to complete. Simply snap the old part out and snap the new part into place. You will not require any tools to complete the job. This is an authentic part approved by the manufacturer."
  },
  {
    "id": "PS3406971-install",
    "part_number": "PS3406971",
    "title": "Lower Dishrack Wheel W10195416",
    "url": "https://www.partselect.com/PS3406971-Whirlpool-W10195416-Lower-Dishrack-Wheel.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This OEM gray Dishwasher Lower Dishrack Wheel Assembly is a plastic kit that allows the rack to slide in and out of the dishwasher easily. If it breaks or becomes damaged. sliding will feel difficult. This can happen due to normal wear and tear, and the part should be replaced if this occurs. Check your model number and user manual to make sure this part is correct. It attaches directly to the dishrack. To repair, open the dishwasher door and pull out the lower dishrack. Next, push the tab from both sides and it should pop out. To install the new wheel assembly, place it on the rack and make sure the caps overlap the wire from the inside before you clip it in place by pushing the wheel. It measures roughly 3x6 inches."
  },
  {
    "id": "PS11750057-install",
    "part_number": "PS11750057",
    "title": "Dishwasher Lower Dishrack Roller WPW10195417",
    "url": "https://www.partselect.com/PS11750057-Whirlpool-WPW10195417-Dishwasher-Lower-Dishrack-Roller.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This gray plastic lower dishrack roller is a part for your dishwasher. It attaches to the bottom of the lower dishrack, allowing it to move in and out smoothly. If the lower dishrack stops moving in and out easily or preventing you from being able to shut the dishwasher door, inspect the dishrack roller for damage. The assembly includes 2 rollers and the bracket that attaches to the dishrack (parts are not sold separately). This assembly is sold individually, so you will need 4 assemblies to replace them all in your appliance. For this easy repair, start by removing the lower dishrack from the appliance and set it on the counter. Use a screwdriver to pry off the old roller assembly from the lower tabs. Align the new part on the dishrack by snapping it in place."
  },
  {
    "id": "PS16217024-install",
    "part_number": "PS16217024",
    "title": "Dishwasher Lower Rack Roller WD12X26146",
    "url": "https://www.partselect.com/PS16217024-GE-WD12X26146-Dishwasher-Lower-Rack-Roller.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The lower rack roller supports the smooth sliding of your dishwasher’s bottom rack. Measuring 1.5 inches in diameter and charcoal-colored, this OEM replacement part is sold individually. Replace all four rollers at once for consistent performance. Wear gloves during installation."
  },
  {
    "id": "PS12585623-install",
    "part_number": "PS12585623",
    "title": "Lower Spray Arm 5304517203",
    "url": "https://www.partselect.com/PS12585623-Frigidaire-5304517203-Lower-Spray-Arm.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The Lower Spray Arm is used in your dishwasher to spray water and clean your dishes. If broken there will be visible damage or your dishes may no longer be cleaned properly. If your spray arm is broken (due to general wear or high heat), it should be replaced. Your lower spray arm will be located at the bottom of your dishwasher tub. Check your user manual and model number to ensure this model is right for you. This version is plastic and metal and comes in gray/blue. We recommend you wear work gloves to keep your hands safe when installing and disconnect power to the appliance. You will also want to make sure that you turn off the water supply to your dishwasher. From here, you will want to open the dishwasher, pull out the lower rack and set it aside. Remove the lower wash arm. On each side of the bottom of the spray arm, there are small locking tabs that can be pushed aside using a flathead screwdriver. Once released, the spray arm can easily be pulled off the dishwasher. Put the new lower wash arm in place and push it down to lock it in. Ensure it is spinning freely and does not hit the heating element. Return the lower dish rack into place and then close the dishwasher door."
  },
  {
    "id": "PS17137081-install",
    "part_number": "PS17137081",
    "title": "LOWER SPRAY ARM WD22X33499",
    "url": "https://www.partselect.com/PS17137081-GE-WD22X33499-LOWER-SPRAY-ARM.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This lower spray arm assembly in your dishwasher distributes water and detergent during the washing cycle by spinning around and spraying water in different directions. You can usually find it attached to a support or hub at the bottom of the dishwasher. If this part is broken, you might notice some signs. You might hear a knocking or banging sound coming from the dishwasher. The spray arm may not rotate properly or might seem wobbly. It is important to replace a damaged arm assembly as your dishes will not get cleaned properly, and they will still have dirt on them even after a wash cycle. It can also cause the dishwasher to have a bad smell because of leftover food residue. To remove your existing arm assembly, you will need to release its locking mechanism before lifting it out of your appliance. Please be informed that this OEM-verified part that DOES NOT come with the heatshield, as per GE directly. This item is sold individually."
  },
  {
    "id": "PS12705424-install",
    "part_number": "PS12705424",
    "title": "Lower Spray Arm 5304518927",
    "url": "https://www.partselect.com/PS12705424-Frigidaire-5304518927-Lower-Spray-Arm.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This lower spray arm assembly is a device in your dishwasher that distributes water and detergent during the washing cycle. Its rotating motion sprays water in multiple directions, ensuring thorough cleaning. Typically, it is attached to a support or hub at the bottom of the dishwasher. When this part is broken, there are noticeable signs to be aware of. You might hear knocking or banging sounds coming from the dishwasher. The spray arm may be wobbly or unable to rotate. If a broken arm assembly is not replaced, your dishes may still have dirt on them even after a wash cycle. Additionally, leftover food residue can result in an unpleasant smell within the dishwasher. To remove the existing arm assembly, simply grasp the center of it and lift it up so that it unsnaps from your dishwasher. Please note that this OEM-sourced part is sold individually."
  },
  {
    "id": "PS9495545-install",
    "part_number": "PS9495545",
    "title": "Dishwasher Bottom Door Gasket 809006501",
    "url": "https://www.partselect.com/PS9495545-Frigidaire-809006501-Dishwasher-Bottom-Door-Gasket.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This dishwasher door gasket (Bottom Gasket, Gasket, Door Seal, Dishwasher Door Lower Seal) helps prevent water from leaking out of the bottom edge of your dishwasher door by creating a watertight seal. This part is attached to the bottom of your dishwasher inner door panel. It is frequently exposed to water and detergent during its lifetime. The water and chemicals can eventually wear down the gasket and compromise the integrity of the seal. If the gasket is malfunctioning, the integrity of the door seal will be effected. You will notice leaking through the bottom of your dishwasher door. If your dishwasher is leaking water from the bottom of the door, first inspect the seal for food particles near the bottom and sides, and remove the buildup, as it can stop the door from closing properly and keeping a tight seal; if not, you may need to replace the bottom door gasket. Check the door gasket for tears, cuts, or wear. This part is sold individually and measures 22.5 inches by 1.25 inches. It is constructed of plastic, and comes in yellow/grey. Includes one lower door gasket."
  },
  {
    "id": "PS8260227-install",
    "part_number": "PS8260227",
    "title": "Dishwasher Tub Gasket (Gray) 154827601",
    "url": "https://www.partselect.com/PS8260227-Frigidaire-154827601-Dishwasher-Tub-Gasket-Gray.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This grey OEM dishwasher tub gasket is a 73\" grey rubber part that creates a seal around the dishwasher to prevent any water leakage during a cycle. If it's damaged or broken, you'll start seeing water leaking out. If broken, it should be replaced. Refer to your model number and user manual to ensure this part is right for you. When making this repair, open the dishwasher door and take out the lower dish tray for better access. Pull out the old gasket, and clean the channel with a rag. Push the new gasket into place into the notch on the door, which you should see upon close inspection, using a flat-head screwdriver for assistance if necessary. We do not recommend cutting any additional length off on the tub gasket if any is present during your repair."
  },
  {
    "id": "PS12348515-install",
    "part_number": "PS12348515",
    "title": "Dishwasher Door Seal W11177741",
    "url": "https://www.partselect.com/PS12348515-Whirlpool-W11177741-Dishwasher-Door-Seal.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Door seal seals the gap between the opening to the dishwasher tub and the outer edge of the door."
  },
  {
    "id": "PS12081829-install",
    "part_number": "PS12081829",
    "title": "Dishwasher Holder MEG64438801",
    "url": "https://www.partselect.com/PS12081829-LG-MEG64438801-Dishwasher-Holder.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This holder, also known as a mounting bracket, is responsible for securing the dish rack in place inside your dishwasher during cleaning. It is a genuine OEM replacement part sourced directly from LG to ensure a perfect fit for your dishwasher. It is gray in color and measures 1 inch by 1 inch. If the holder is lost or broken, your dish racks may become dislodged or unstable and cause damage inside the dishwasher. Each holder is sold individually."
  },
  {
    "id": "PS12081830-install",
    "part_number": "PS12081830",
    "title": "Dishwasher Holder MEG64438901",
    "url": "https://www.partselect.com/PS12081830-LG-MEG64438901-Dishwasher-Holder.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a dishrack holder designed for various models of LG dishwashers. The purpose of this holder is to secure various parts within the dishwasher, such as the cutlery basket. This holder measures approximately 1 inch long and 0.4 inches wide, is made of plastic, and features two hooks that attach themselves to the frame of the rack. This genuine OEM holder comes as an individual part, so if you require multiple holders, consider that before ordering."
  },
  {
    "id": "PS8756263-install",
    "part_number": "PS8756263",
    "title": "Dishwasher Clip Lower Rack WD12X20171",
    "url": "https://www.partselect.com/PS8756263-GE-WD12X20171-Dishwasher-Clip-Lower-Rack.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Upgrade your GE dishwasher with this essential Lower Rack Clip. This durable tine row clip holds the tine row in its proper position, ensuring smooth and efficient operation. Specifically designed for GE appliances, it offers a perfect fit, promising long-lasting performance and reliability. Though the fitting process is straightforward, it is recommended to wear work gloves to protect your hands during the installation. Enhance the functionality and lifespan of your appliance with this GE Lower Rack Clip. Secure your dishwasher's capabilities today with this high-quality part."
  },
  {
    "id": "PS16744934-install",
    "part_number": "PS16744934",
    "title": "Circulation Pump W11612326",
    "url": "https://www.partselect.com/PS16744934-Whirlpool-W11612326-Circulation-Pump.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This circulation pump is a genuine OEM replacement part designed for use in dishwashers. It is responsible for circulating water throughout the dishwasher during the wash and rinse cycles. The circulation pump draws water from the dishwasher tub, pressurizes it, and then distributes it to the spray arms, which spray the water onto the dishes to remove food particles and debris. The circulation pump may fail due to several reasons such as an electrical fault, a blockage in the pump impeller, motor failure, or physical damage. A faulty pump will result in water leakages, unusually loud noises during use, reduced water circulation, and poor cleaning performance."
  },
  {
    "id": "PS11753379-install",
    "part_number": "PS11753379",
    "title": "Dishwasher Drain Pump 120v 60hz WPW10348269",
    "url": "https://www.partselect.com/PS11753379-Whirlpool-WPW10348269-Dishwasher-Drain-Pump-120v-60hz.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This drain pump is used in dishwashers to remove water from the dishwasher tub. If the impeller in the dishwasher is damaged or the motor has been shorted out and will not drain, it is possible the body is cracked, causing leakage. To prevent this from happening, replace the drain pump. The tools needed for this installation are: Phillips screwdriver, 5/16 inch nut driver, 5/8 inch wrench, and a flathead screwdriver. Remember to unplug your dishwasher from the power source before beginning this installation project. Refer to the manual provided by the manufacturer for further installation instructions."
  },
  {
    "id": "PS11724988-install",
    "part_number": "PS11724988",
    "title": "Dishwasher Circulation Pump w/Heater 12008381",
    "url": "https://www.partselect.com/PS11724988-Bosch-12008381-Dishwasher-Circulation-Pump-w-Heater.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This circulation pump with heater is for dishwashers. Circulation pump with heater moves heated water through the spray arm to clean the dishes. Unplug the dishwasher before installing this part. Wear work gloves to protect your hands."
  },
  {
    "id": "PS8260087-install",
    "part_number": "PS8260087",
    "title": "Dishwasher Heating Element W10518394",
    "url": "https://www.partselect.com/PS8260087-Whirlpool-W10518394-Dishwasher-Heating-Element.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This manufacturer-certified heating element is used to create heat during the dry cycle and increase water temperature during portions of the wash cycle when certain options are selected. If your dishes are not drying or the water in the dishwasher is not getting hot you may need to replace the element. This kit includes the heater, two heater fasteners, and is a genuine OEM part. Please remember to disconnect the power before starting the repair. Use a multi-meter to test your heating element for continuity to determine whether this is the part that is causing your symptom. This part does not include any washers. To make your repair, disconnect the wires from the bottom of the element in the back, remove the plastic nuts holding it in place, remove the element, and repeat these steps in reverse order to install your new part. This is an easy repair that requires only a screwdriver, wrench set, and should take less than 30 minutes."
  },
  {
    "id": "PS9494999-install",
    "part_number": "PS9494999",
    "title": "Dishwasher Heating Element W10703867",
    "url": "https://www.partselect.com/PS9494999-Whirlpool-W10703867-Dishwasher-Heating-Element.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The heating element is not designed to heat the water that enters it, but is designed to maintain the heat of the water that enters the dishwasher. It is located on the bottom of the dishwasher."
  },
  {
    "id": "PS16729156-install",
    "part_number": "PS16729156",
    "title": "HEATING ELEMENT WD05X30818",
    "url": "https://www.partselect.com/PS16729156-GE-WD05X30818-HEATING-ELEMENT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The element heating assembly is found at the bottom of the dishwasher tub, and helps to warm the water in the wash cycle, and dry the dishes afterward. If the water does not heat up during the wash cycle, or the dishes are not being dried properly, you may need to replace the element heating assembly in your dishwasher. This element heating assembly is horseshoe-shaped and is sold individually. To replace your heating assembly, first make sure it has cooled down, then simply slide the connecting tabs out. Replace with a new heating element and your problem should be solved."
  },
  {
    "id": "PS16218716-install",
    "part_number": "PS16218716",
    "title": "Latch 5304525218",
    "url": "https://www.partselect.com/PS16218716-Frigidaire-5304525218-Latch.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door latch with the switches is a simple on/off mechanism that prohibits the dishwasher from operating when the door is open."
  },
  {
    "id": "PS11748729-install",
    "part_number": "PS11748729",
    "title": "Dishwasher Door Handle And Latch Assembly with Switch WPW10130695",
    "url": "https://www.partselect.com/PS11748729-Whirlpool-WPW10130695-Dishwasher-Door-Handle-And-Latch-Assembly-with-Switch.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door latch (Dishwasher Door Latch Assembly, Door Latch Assembly, Latch Assembly) is a simple on/off mechanism that prohibits the dishwasher from operating when the door is open. It is located on the door of your dishwasher, and is mounted on the inner door panel. The door latch can break from material fatigue. If the door is often slammed or opened quickly, the latch may break prematurely. If the door won't open or the door switches won't activate, you will need to replace this part. This latch measures 5 1/2 inches wide, 4 1/2 inches high, 2 1/2 inches deep, is constructed out of plastic and comes in black. The kit includes the black handle, latch, and 2 switches."
  },
  {
    "id": "PS334230-install",
    "part_number": "PS334230",
    "title": "Dryer Door Catch Kit 279570",
    "url": "https://www.partselect.com/PS334230-Whirlpool-279570-Dryer-Door-Catch-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part replaces your appliances latch (Door Latch Kit, Door Catch, Dryer Door Latch Kit). On your appliance you will find both a strike and a catch. The strike is mounted on the body of the dryer, while the catch is mounted on the dryer door. These two parts work together to keep your dryer door closed. The catch holds the door strike to keep the door closed during the drying cycle. If the door does not latch closed, you won’t be able to start a drying cycle. If this part is malfunctioning, you may not be able to open or close your door. In some instances, it may seem like your door is closing, but if it is not latching properly you won’t be able to start your drying cycle. You should replace this part as soon as it’s malfunctioning. Your dryer may run even though the latch is malfunctioning, but it is unsafe if the dryer continues to run while the door is open. This replacement part features 1 door latch kit which includes 2 strikes, 3 catches, and a set of instructions. This model is constructed of plastic and metal, and comes in white/silver."
  },
  {
    "id": "PS16746057-install",
    "part_number": "PS16746057",
    "title": "Access Valve 10023852",
    "url": "https://www.partselect.com/PS16746057-Bosch-10023852-Access-Valve.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This water access valve, also known as a water inlet valve, is an authentic OEM replacement part used in dishwashers. The valve controls the flow of water into the dishwasher. It is responsible for allowing water from the household water supply to enter the dishwasher tub during the wash cycle. The valve is controlled by the electronic control board, which signals it to open or close based on the selected cycle and water level requirements. Once the dishwasher is filled to the appropriate level, the water inlet valve closes to prevent any further water from entering the tub. If the valve is faulty, you will likely experience water leakages, difficulties filling dishwasher, and poor cleaning results. This part is commonly associated with the E15 error code on dishwashers."
  },
  {
    "id": "PS1990907-install",
    "part_number": "PS1990907",
    "title": "Water Inlet Valve (120v 60hz) 154637401",
    "url": "https://www.partselect.com/PS1990907-Frigidaire-154637401-Water-Inlet-Valve-120v-60hz.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This water inlet valve is usually located behind the lower kickplate panel in either the right or left corner of the dishwasher. The attaching solenoids on the valve open and close according to the desired amount of water needed. The water inlet valve on your dishwasher supplies water to the dishwasher. If your dishwasher is leaking because it has overflowed, the water inlet valve may be the cause. If your dishwasher continues to fill above the heating element, try opening the door latch to see if it stops filling. If it continues to fill, you have a defective inlet valve that will need to be replaced."
  },
  {
    "id": "PS12578165-install",
    "part_number": "PS12578165",
    "title": "Dishwasher INLET VALVE W11175771",
    "url": "https://www.partselect.com/PS12578165-Whirlpool-W11175771-Dishwasher-INLET-VALVE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This water inlet valve should be located behind the lower kick plate panel in either the right or left corner. The attaching solenoids on the valve open and close according to the desired amount of water needed."
  },
  {
    "id": "PS11759673-install",
    "part_number": "PS11759673",
    "title": "Dishwasher Filter W10872845",
    "url": "https://www.partselect.com/PS11759673-Whirlpool-W10872845-Dishwasher-Filter.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This filter works with the water pump in your dishwasher. It prevents debris from entering the pump and causing damage. As a result, the filter can occasionally become clogged or damaged, and will need to be replaced. A good indication of a damaged filter is if your dishwasher is not draining or cleaning the dishes properly. This filter has a gray plastic top and bottom that are approximately 5 inches in diameter. This is a genuine OEM part that comes directly from the manufacturer. To replace the filter, simply turn it counterclockwise to unlock, and then screw in the new filter"
  },
  {
    "id": "PS11770489-install",
    "part_number": "PS11770489",
    "title": "Dishwasher Filter 5304506525",
    "url": "https://www.partselect.com/PS11770489-Frigidaire-5304506525-Dishwasher-Filter.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This filter is for dishwashers. The filter removes food particles and debris from the water to prevent the drain from clogging. Follow the instructions in the manual when installing this part."
  },
  {
    "id": "PS11755148-install",
    "part_number": "PS11755148",
    "title": "Screen WPW10463906",
    "url": "https://www.partselect.com/PS11755148-Whirlpool-WPW10463906-Screen.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a screen filter, designed to keep food particles, gunk, and debris from entering the pump of your dishwasher. If this filter is missing, damaged, or simply unusable, it will need to be replaced so you can effectively clean your dishes. Replacing this filter is simple, as you only need to twist and remove the lower filter, before you can carefully lift this filter out. This filter is an OEM part and is sold individually."
  },
  {
    "id": "PS9494138-install",
    "part_number": "PS9494138",
    "title": "Dishwasher Drain Hose 807117001",
    "url": "https://www.partselect.com/PS9494138-Frigidaire-807117001-Dishwasher-Drain-Hose.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "If your dishwasher is leaking or not draining properly, you may need to replace the drain hose. The drain hose connects to the pump located below the lower spray arm and aids in proper dishwasher drainage. This white and black plastic hose is 7.5 feet long. For this repair, you will need either a 1/4-inch or 5/16-inch nut driver, depending on your model. You will need to remove the lower access panel on your dishwasher to complete this repair; it is often easier to remove the dishwasher from the cabinet to do so. Be sure to disconnect the dishwasher from both the power and water supply before completing this repair."
  },
  {
    "id": "PS16621806-install",
    "part_number": "PS16621806",
    "title": "Hose Drain Assembly AEM74333104",
    "url": "https://www.partselect.com/PS16621806-LG-AEM74333104-Hose-Drain-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This LG drain hose assembly is a genuine OEM replacement that is compatible with various LG washers. The assembly includes the hose and plastic connectors. The flexible rubber hose transports used water from the washer tub out into a dedicated drainage system such as a laundry sink or standpipe. The drain hose may become clogged, dislodged, or damaged by loose items like coins in the laundry or by hard impacts from outside. If the hose is faulty, you will likely notice standing water in the washer tub after a cycle, mold growth, leaking, or water overflow. It is recommended to replace the drain hose promptly if it is faulty to ensure the proper functioning of your washer."
  },
  {
    "id": "PS8737004-install",
    "part_number": "PS8737004",
    "title": "Dishwasher Hosedrain 00744881",
    "url": "https://www.partselect.com/PS8737004-Bosch-00744881-Dishwasher-Hosedrain.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS10064063-install",
    "part_number": "PS10064063",
    "title": "Dishwasher Dish Rack Adjuster Kit (Left And Right Side) W10712394",
    "url": "https://www.partselect.com/PS10064063-Whirlpool-W10712394-Dishwasher-Dish-Rack-Adjuster-Kit-Left-And-Right-Side.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This rack adjuster kit (Dishrack Adjuster Kit, Adjuster Kit, Dishwasher Rack Adjuster) will adjust the height of the upper rack of your dishwasher. It connects to the dishrack. The kit is constructed of grey plastic and metal, and measures approximately 12 inches wide and 6.5 inches tall. The rack adjuster can break from material fatigue or prolonged high temperature exposure. High temperature exposure can compromise the integrity of the materials. If the rack adjuster breaks, your upper rack may fall down, may be unlevel, or the door may not close. This kit includes the parts to replace the left and right-side rack adjusters and has been upgraded to a more durable metal design (2 adjuster assemblies, 1 left hand and 1 right hand actuator cover, 2 gray adjuster covers, and 2 gray adjuster housings)"
  },
  {
    "id": "PS12730058-install",
    "part_number": "PS12730058",
    "title": "Lower Dishrack 20000533",
    "url": "https://www.partselect.com/PS12730058-Bosch-20000533-Lower-Dishrack.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This lower dishrack is designed to keep dishes securely in place throughout the wash cycle, helping to prevent shifting and breakage. Built for durability and a precise fit, it’s compatible with select dishwasher models and offers a reliable solution for restoring or upgrading your appliance’s interior. Installation is straightforward and tool-free—simply position the rack in place according to your dishwasher’s layout. For optimal performance, refer to your appliance’s manual to confirm compatibility and ensure proper placement."
  },
  {
    "id": "PS16618974-install",
    "part_number": "PS16618974",
    "title": "Lower Rack & SWB Replacement Kit WD28X28918",
    "url": "https://www.partselect.com/PS16618974-GE-WD28X28918-Lower-Rack-SWB-Replacement-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This dish rack is for dishwashers. Dish rack holds the dishes in place during the dish washing cycle"
  },
  {
    "id": "PS11745496-install",
    "part_number": "PS11745496",
    "title": "Dishwasher Mounting Bracket WP8269145",
    "url": "https://www.partselect.com/PS11745496-Whirlpool-WP8269145-Dishwasher-Mounting-Bracket.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The mounting bracket is sold individually, without screws. This part secures the upper side of the dishwasher to the underside of the counter or cabinet to prevent the dishwasher from moving, shaking, or tilting forward. The bracket is made entirely of metal. It is recommended to check all brackets, if applicable, because they often wear at the same rate and both may need to be replaced. This is an OEM part that is sourced from the authentic manufacturer. Tools needed are a pair of needle nose pliers and a screwdriver."
  },
  {
    "id": "PS8728568-install",
    "part_number": "PS8728568",
    "title": "Mounting Bracket 00619985",
    "url": "https://www.partselect.com/PS8728568-Bosch-00619985-Mounting-Bracket.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Sold individually."
  },
  {
    "id": "PS16219683-install",
    "part_number": "PS16219683",
    "title": "COUNTERTOP BRACKET WD01X27759",
    "url": "https://www.partselect.com/PS16219683-GE-WD01X27759-COUNTERTOP-BRACKET.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This countertop bracket is an OEM replacement part specially designed for dishwashers. The bracket is made from stainless steel, and it is responsible for securing the top edge of the dishwasher to the underside of the kitchen countertop. This safety mechanism keeps the dishwasher safe and prevents injury to users by preventing the dishwasher from tipping forward whenever the door is opened or closed. Each countertop bracket is sold individually, therefore, ensure you have ordered the correct amount for your dishwasher. Mounting hardware is sold separately."
  },
  {
    "id": "PS972325-install",
    "part_number": "PS972325",
    "title": "Dishwasher Door Balance Link Kit 8194001",
    "url": "https://www.partselect.com/PS972325-Whirlpool-8194001-Dishwasher-Door-Balance-Link-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is a door balance link kit, also sometimes known as door cable or door spring cable kit, that helps support the door as it opens and closes by connecting to the dishwasher door hinges. The kit includes two door balance links and two door balance mounts with wheels, which will replace both the left and right sides. The only tool needed is a 5/16 nut driver. Before removing the existing kit, take note of how the door balance link kit is assembled for a smooth replacement process. It is recommended to check the door springs in case they need to be replaced as well."
  },
  {
    "id": "PS3524406-install",
    "part_number": "PS3524406",
    "title": "Dishwasher Connector Assembly 4933DD3001B",
    "url": "https://www.partselect.com/PS3524406-LG-4933DD3001B-Dishwasher-Connector-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This dishwasher door hinge cable assembly connects the door to the spring. The door hinge cable and the door spring apply tension to the door to prevent it from dropping open too quickly. This part contains two plastic pieces which are approximately 2 inches in length by 3/4-inch in width, as well as a rope portion that measures approximately 8 inches in length. When beginning this repair, be sure to use caution when replacing the door hinge cable. The spring to which the door hinge cable attaches is under tension and could snap. This part is sold individually."
  },
  {
    "id": "PS11745488-install",
    "part_number": "PS11745488",
    "title": "Dishwasher Friction Sleeve WP8268961",
    "url": "https://www.partselect.com/PS11745488-Whirlpool-WP8268961-Dishwasher-Friction-Sleeve.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part helps to keep your door quiet when it opens and closes."
  },
  {
    "id": "PS16620843-install",
    "part_number": "PS16620843",
    "title": "Spring And Cable Assembly 5304530071",
    "url": "https://www.partselect.com/PS16620843-Frigidaire-5304530071-Spring-And-Cable-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the Door Spring & Cable Assembly by Frigidaire, a trusted name in home appliances. This essential assembly is designed to control how quickly your dishwasher door opens, sparing you from abrupt door drops. As a genuine OEM part, it's compatibility extends to selected models of Frigidaire, Electrolux, White Westinghouse, and Tappan dishwashers. The kit includes a door spring and cable to provide optimal tension reinforcement via the door hinge. Please be advised that despite visual similarities, parts may vary subtly in size and shape as per model requirements. Do exercise caution and protective measures, such as wearing gloves, when installing due to the spring's tension."
  },
  {
    "id": "PS8770519-install",
    "part_number": "PS8770519",
    "title": "Dishwasher Door Spring Kit 00754866",
    "url": "https://www.partselect.com/PS8770519-Bosch-00754866-Dishwasher-Door-Spring-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This kit includes 2 spring and 2 cables. This door spring kit is for dishwashers. Door spring kit applies tension to the dishwasher door through the door hinge to prevent the door from dropping too quickly when you open the dishwasher. The kit may include multiple parts; refer to your parts diagram for a list of parts included."
  },
  {
    "id": "PS3524564-install",
    "part_number": "PS3524564",
    "title": "Dishwasher Hinge Spring 4970ED4004G",
    "url": "https://www.partselect.com/PS3524564-LG-4970ED4004G-Dishwasher-Hinge-Spring.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The door spring, used in dishwashers, adds tension to the door through the door hinge to keep it from opening too fast. If you have a door latch failure or your washer door drops too quickly when opened, it is best you replace this part to fix the problem. Refer to the manual provided by the manufacturer for installation instructions and further repair guidance. Unplug your dishwasher from the power source before you begin this repair project as a safety precaution."
  },
  {
    "id": "PS11731570-install",
    "part_number": "PS11731570",
    "title": "Detergent Dispenser W10861000",
    "url": "https://www.partselect.com/PS11731570-Whirlpool-W10861000-Detergent-Dispenser.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Detergent dispenser W10861000 is an original equipment manufacturer (OEM) part that fits some Whirlpool, KitchenAid, Maytag and Amana dishwashers. Detergent dispenser W10861000 attaches to the inner door panel and holds the dishwasher detergent and rinse aid in covered compartments. This dishwasher detergent dispenser measures approximately 5 inches wide and 4.5 inches high."
  },
  {
    "id": "PS12710077-install",
    "part_number": "PS12710077",
    "title": "DIVERTER ASSEMBLY KIT WD19X25278",
    "url": "https://www.partselect.com/PS12710077-GE-WD19X25278-DIVERTER-ASSEMBLY-KIT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This diverter valve assembly is sourced from the original manufacturer for use in dishwashers. The assembly controls the flow of water between different parts of the appliance. It directs water to either the upper or lower spray arms during different stages of the wash cycle, ensuring efficient cleaning of dishes throughout the dishwasher. The valve may become damaged or worn down over time due to frequent use and exposure to heat and chemicals. If the assembly is faulty, you will likely notice leaking from under the door and less water reaching the spray arms. It is best to replace the assembly promptly to avoid further damage to the dishwasher."
  },
  {
    "id": "PS11750167-install",
    "part_number": "PS11750167",
    "title": "Dishwasher Detergent Dispenser Assembly WPW10199696",
    "url": "https://www.partselect.com/PS11750167-Whirlpool-WPW10199696-Dishwasher-Detergent-Dispenser-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part releases the detergent and rinse aid into the dishwasher. Light grey in color. The detergent dispenser attaches to the inner door panel and holds the dishwasher detergent and rinse agent in a covered compartment."
  },
  {
    "id": "PS11770481-install",
    "part_number": "PS11770481",
    "title": "Stop Clip 5304506510",
    "url": "https://www.partselect.com/PS11770481-Frigidaire-5304506510-Stop-Clip.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This rail end cap, or dishrack stop clip, is a genuine OEM replacement part for your dishwasher. This part keeps the rack in your dishwasher from sliding out. This is a very easy repair, to complete it you only need a flat blade screwdriver. Use the screwdriver to pry the locking tab open on the cap, located at the front of your upper dishrack. Pull off the end cap and lock the new one into place."
  },
  {
    "id": "PS7783360-install",
    "part_number": "PS7783360",
    "title": "Dishwasher End Cap WD12X10426",
    "url": "https://www.partselect.com/PS7783360-GE-WD12X10426-Dishwasher-End-Cap.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is an end cap for a dishwasher rack. This part is about 2.5 inches long, is black, and is made of plastic. You may need to replaced this part if it is broken, or if your dishwasher rack continuously falls off the track or rail."
  },
  {
    "id": "PS11746426-install",
    "part_number": "PS11746426",
    "title": "Dishwasher Rinse Aid Cap WP8558307",
    "url": "https://www.partselect.com/PS11746426-Whirlpool-WP8558307-Dishwasher-Rinse-Aid-Cap.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The rinse aid cap (sometimes referred to as the dispenser cap), covers the rinse aid dispenser on the dishwasher door. If your dishwasher will not dispense detergent, or it is leaking detergent, there could be an issue with the rinse aid cap. Check the cap and its gasket for any damage or melting. If the cap has melted or it is not sealing the dispenser properly, the part should be replaced right away. This rinse aid cap comes with the gasket, so you should discard the existing gasket and rinse aid cap at the same time. The repair is relatively straightforward, and requires no tools."
  },
  {
    "id": "PS16873737-install",
    "part_number": "PS16873737",
    "title": "Main Control Board WD21X32165",
    "url": "https://www.partselect.com/PS16873737-GE-WD21X32165-Main-Control-Board.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This main control board is a genuine OEM part that is designed for dishwashers. It is responsible for controlling the operation of the dishwasher. It monitors all the dishwasher cycles including wash, rinse, dry, and sanitization. It receives input from the control panel and sends commands to various components of the dishwasher, such as the motor, pump, heating element, and sensors, to control the different cycles and functions of the appliance. Signs of a faulty control board include an unresponsive control panel, error codes, interrupted wash cycles, or a burning smell, which indicates a short circuit."
  },
  {
    "id": "PS17137058-install",
    "part_number": "PS17137058",
    "title": "Configured User Interface Control Board WD21X31902C",
    "url": "https://www.partselect.com/PS17137058-GE-WD21X31902C-Configured-User-Interface-Control-Board.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is the user interface control board for various dishwashers. The user interface panel is what you directly interact with on your dishwasher to start and stop it and select the specific cycle you want. If your user interface panel is not responding and you have tested your dishwasher to ensure no other part could be at fault, it will need to be replaced immediately for it to regain function. Replacing this panel will requires some disassembly of your dishwasher, and will require tools like a screwdriver, wrench, and a pair of pliers. This OEM user interface panel measures approximately 14-inches wide and is sold individually."
  },
  {
    "id": "PS16762507-install",
    "part_number": "PS16762507",
    "title": "CONFIGURED UI BOARD WD21X31909",
    "url": "https://www.partselect.com/PS16762507-GE-WD21X31909-CONFIGURED-UI-BOARD.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the Configured UI Board by GE, specifically designed for impeccable performance and lasting durability. This crucial component ensures seamless operations of your appliance by facilitating smooth user interface functions. Crafted with meticulous attention to quality, the GE Configured UI Board sustains optimal functionality while promising uncompromising reliability for your appliance. This component part ensures that your appliance runs efficiently and withstands the test of time. Invest in GE excellence and enhance your appliance's performance with this Configured UI Board. Exceptional performance and reliability are just a click away."
  },
  {
    "id": "PS3579323-install",
    "part_number": "PS3579323",
    "title": "Dishwasher Diverter Pump Motor 4681ED3001D",
    "url": "https://www.partselect.com/PS3579323-LG-4681ED3001D-Dishwasher-Diverter-Pump-Motor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This diverter motor, or stepper motor, controls the movement of the spray arms in your dishwasher. It directs water between the drain pump and the spray arms by turning a check valve inside the pump, managing the flow of water to these spray arms. This diverter motor runs on 120 volts and 60 Hz. When this motor fails, the dishwasher will not wash or drain properly. Please keep in mind that this genuine OEM replacement part is sold separately from the spray arms."
  },
  {
    "id": "PS12712308-install",
    "part_number": "PS12712308",
    "title": "Motor and Pump Assembly 5304519906",
    "url": "https://www.partselect.com/PS12712308-Frigidaire-5304519906-Motor-and-Pump-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The motor and pump assembly is a critical component of select dishwashers, responsible for circulating water through the spray arms during the wash cycle. This ensures thorough cleaning of dishes by maintaining a steady flow of water at optimal pressure. This replacement part functions like the original, though minor design variations may exist. Before installing, disconnect the power supply at the circuit breaker to prevent electrical hazards. Wearing protective gloves is recommended to ensure a safe installation."
  },
  {
    "id": "PS3497737-install",
    "part_number": "PS3497737",
    "title": "Pump Motor Kit 154844301",
    "url": "https://www.partselect.com/PS3497737-Frigidaire-154844301-Pump-Motor-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This circulation pump motor assembly is designed for use in compatible dishwashers and plays a vital role in distributing water and detergent to the spray arms for thorough cleaning. It includes the motor and necessary O-rings for installation. Common symptoms of a failing pump include poor cleaning performance, leaks, unusual noises, or the dishwasher failing to start. This replacement part is sold individually and is compatible with a range of models across multiple brands."
  },
  {
    "id": "PS8690623-install",
    "part_number": "PS8690623",
    "title": "Dishwasher Flood Switch WD21X10519",
    "url": "https://www.partselect.com/PS8690623-GE-WD21X10519-Dishwasher-Flood-Switch.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a flood switch assembly for your washer. The flood switch controls the hot and cold water filling your washer tub to ensure the proper amount of water. You may need to replace this part if your washer is overfilling or underfilling with water. It is about 5.5 inches in length, and mostly black in color with a green tip."
  },
  {
    "id": "PS1481923-install",
    "part_number": "PS1481923",
    "title": "Drain Solenoid and Bracket Assembly WD21X10268",
    "url": "https://www.partselect.com/PS1481923-GE-WD21X10268-Drain-Solenoid-and-Bracket-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This valve opens in order for the water to drain out of the dishwasher."
  },
  {
    "id": "PS1481922-install",
    "part_number": "PS1481922",
    "title": "Dryer Switch WD21X10261",
    "url": "https://www.partselect.com/PS1481922-GE-WD21X10261-Dryer-Switch.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The interlock switch may also be referred to as a belt switch. This part is a simple on/off mechanism that prohibits the appliance from operating when the door is open. This is a part for your dryer. The interlock switch senses the door is shut and the dryer can begin. This part might need to be replaced if your dryer is not starting or is in process while the door is open. The black rectangular part of the switch is approximately 2 inches long and a 1/2-inch wide with two gold plates on either end. This is a genuine OEM part that is sourced right from the manufacturer."
  },
  {
    "id": "PS11743423-install",
    "part_number": "PS11743423",
    "title": "Dishwasher High Limit Thermostat WP661566",
    "url": "https://www.partselect.com/PS11743423-Whirlpool-WP661566-Dishwasher-High-Limit-Thermostat.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part acts as as safety mechanism that keeps the dryer from overheating. Once the dryer temperature reaches a certain point, this part will shut down power to the heating element."
  },
  {
    "id": "PS11750035-install",
    "part_number": "PS11750035",
    "title": "Dishwasher Thermostat WPW10195091",
    "url": "https://www.partselect.com/PS11750035-Whirlpool-WPW10195091-Dishwasher-Thermostat.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This genuine OEM thermostat is sourced directly from the manufacturer to ensure compatibility with your dishwasher model. The thermostat monitors and regulates the temperature of the dishwasher heating element. It is responsible for ensuring that the water temperature reaches the optimal level for effective cleaning while also helping to prevent overheating and potential damage to the internal components of the dishwasher."
  },
  {
    "id": "PS16218719-install",
    "part_number": "PS16218719",
    "title": "THERMOSTAT 5304525221",
    "url": "https://www.partselect.com/PS16218719-Frigidaire-5304525221-THERMOSTAT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a genuine high limit thermostat, which works with dishwashers."
  },
  {
    "id": "PS12741258-install",
    "part_number": "PS12741258",
    "title": "PRESSURE SENSOR ASM WD21X25468",
    "url": "https://www.partselect.com/PS12741258-GE-WD21X25468-PRESSURE-SENSOR-ASM.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a manufacturer-built pressure sensor for dishwashers. This pressure sensor, also known as a pressure switch, is designed to monitor the water pressure, communicate with the control board of the dishwasher, and accurately calculate the necessary amount of water for the washing cycle. If this pressure sensor is bad or not working properly, it will cause over and underfilling of your dishwasher, as well as excessive noise while in operation. To replace this pressure sensor, you will need a screwdriver and wrench to gain access and remove this part, and further disassembly of your dishwasher may be required. This sensor is sold individually and does not come with any other parts."
  },
  {
    "id": "PS11757214-install",
    "part_number": "PS11757214",
    "title": "Dishwasher Turbidity Sensor WPW10705575",
    "url": "https://www.partselect.com/PS11757214-Whirlpool-WPW10705575-Dishwasher-Turbidity-Sensor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Measures level of soil in the water."
  },
  {
    "id": "PS11762982-install",
    "part_number": "PS11762982",
    "title": "SENSOR TURBIDITY Assembly WD21X22830",
    "url": "https://www.partselect.com/PS11762982-GE-WD21X22830-SENSOR-TURBIDITY-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the GE Turbidity Sensor, an integral dishwasher component designed to keep your dishes sparkling clean. This soil sensor operates by detecting the soil level in your dishwasher's water and communicates this information to the control board. As a safety precaution, always disconnect your dishwasher or turn off the house circuit breaker before initiating installation. It's recommended to wear protective gloves during this process to safeguard your hands. Prioritize efficiency and cleanliness with this top-notch GE dishwasher sensor. Don't settle for less; optimize your dishwasher's performance with GE's commitment to quality and innovation."
  },
  {
    "id": "PS8769698-install",
    "part_number": "PS8769698",
    "title": "INSERT 00752274",
    "url": "https://www.partselect.com/PS8769698-Bosch-00752274-INSERT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11766992-install",
    "part_number": "PS11766992",
    "title": "CONSOLE CVR GRAPHICS Assembly WD34X21699",
    "url": "https://www.partselect.com/PS11766992-GE-WD34X21699-CONSOLE-CVR-GRAPHICS-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is the user interface cover, which goes over the user interface panel on compatible dishwashers, so you can easily select and adjust your dishwasher cycle settings. If this interface cover is physically broken and/or not allowing you to select and change cycles on your dishwasher, it should be replaced. Replacing it will require some disassembly of your dishwasher, so tools like a socket wrench and screwdriver will be needed. This cover panel is sold individually and does not come with the computerized control panel included."
  },
  {
    "id": "PS8731294-install",
    "part_number": "PS8731294",
    "title": "INSERT 00651436",
    "url": "https://www.partselect.com/PS8731294-Bosch-00651436-INSERT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11747064-install",
    "part_number": "PS11747064",
    "title": "Dishwasher Wash Arm Bearing Ring WP9742946",
    "url": "https://www.partselect.com/PS11747064-Whirlpool-WP9742946-Dishwasher-Wash-Arm-Bearing-Ring.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part will fit between the newer type lower wash arm and the wash arm retainer nut of your dishwasher."
  },
  {
    "id": "PS9492561-install",
    "part_number": "PS9492561",
    "title": "Wash Arm Bearing 807035801",
    "url": "https://www.partselect.com/PS9492561-Frigidaire-807035801-Wash-Arm-Bearing.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is the replacement wash arm bearing for your dishwasher. It is made of black plastic and is approximately 1 1/4 inches in diameter. The wash arm bearing allows the wash arm to rotate when the dishwasher is operating. A broken bearing can make the wash arm difficult to rotate, and when this occurs, your dishes may not be washed properly. This part is sold individually and is an authentic OEM part sourced directly from the manufacturer."
  },
  {
    "id": "PS2353863-install",
    "part_number": "PS2353863",
    "title": "Dishwasher Upper Spray Arm Bearing WD01X10410",
    "url": "https://www.partselect.com/PS2353863-GE-WD01X10410-Dishwasher-Upper-Spray-Arm-Bearing.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is the upper spray arm bearing for your dishwasher. The spray arm fits onto the spray arm bearing, which allows it to spin during the cycle. If your dishwasher is not cleaning dishes properly, or is making a lot of noise during operation, it could be the result of a damaged spray arm bearing. This part is made of white plastic and is approximately 1 inch long and 1/2 inch wide. This part is sold individually and is a genuine OEM part from the manufacturer."
  },
  {
    "id": "PS385132-install",
    "part_number": "PS385132",
    "title": "Refrigerator Touchup Paint (White) 72017",
    "url": "https://www.partselect.com/PS385132-Whirlpool-72017-Refrigerator-Touchup-Paint-White.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This touch-up paint can be used on a wide variety of household appliances. It is most often used on washers, dryer, refrigerators, dishwashers, ranges, freezers, trash compactors, or microwaves. It is an 18 ml, or.6 fluid ounces, bottle of touch-up paint. It also features a brush for easy application. This quick-drying, long-lasting paint is perfect for fixing any nicks, scratches, or chips on the exterior of your appliance. This paint is white in color, and provides a durable finish."
  },
  {
    "id": "PS347819-install",
    "part_number": "PS347819",
    "title": "White Appliance Paint (12oz) 350930",
    "url": "https://www.partselect.com/PS347819-Whirlpool-350930-White-Appliance-Paint-12oz.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Appliance spray paint is a great way to cover up any chips and scratches that have appeared on your appliances. Instead of replacing the part entirely, this is an easy fix. This is also a great way to give a fresh new look to any handles or areas that have discoloring due to wear. Make sure to clean the area before you begin and wear a protective mask for safety. Give the can a good shake and spray a few inches away from the surface. Apply the paint until the area is fully covered as desired. Wait until the paint has dried before using the appliance."
  },
  {
    "id": "PS385141-install",
    "part_number": "PS385141",
    "title": "Refrigerator Touchup Paint (Black) 72032",
    "url": "https://www.partselect.com/PS385141-Whirlpool-72032-Refrigerator-Touchup-Paint-Black.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This authentic OEM black touch-up paint is specifically designed for repairing minor scratches, chips, or blemishes on your kitchen appliances. The bottle contains 16ml or 0.6oz of black paint and has an applicator brush under the cap, the same way a nail polish bottle is designed. Restoring these visible damages is important because cracked or chipped surfaces can become a breeding ground for dirt and bacteria. If your existing bottle of paint has a thick or clumpy consistency, do not use it. Remember to shake the bottle before applying the paint to your appliance. Please keep in mind that this bottle is sold individually."
  },
  {
    "id": "PS8690632-install",
    "part_number": "PS8690632",
    "title": "Dishwasher Upper Dishrack w/Wheels WD28X10399",
    "url": "https://www.partselect.com/PS8690632-GE-WD28X10399-Dishwasher-Upper-Dishrack-w-Wheels.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This rack comes with the attached rollers"
  },
  {
    "id": "PS16620330-install",
    "part_number": "PS16620330",
    "title": "DRIPTRAY W11550169",
    "url": "https://www.partselect.com/PS16620330-Whirlpool-W11550169-DRIPTRAY.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS9494775-install",
    "part_number": "PS9494775",
    "title": "SHELF W10630200",
    "url": "https://www.partselect.com/PS9494775-Whirlpool-W10630200-SHELF.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12742478-install",
    "part_number": "PS12742478",
    "title": "Dishwasher Rail Assembly AHC73575003",
    "url": "https://www.partselect.com/PS12742478-LG-AHC73575003-Dishwasher-Rail-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS1525080-install",
    "part_number": "PS1525080",
    "title": "Upper Dishrack Slide 154597801",
    "url": "https://www.partselect.com/PS1525080-Frigidaire-154597801-Upper-Dishrack-Slide.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is an upper dishrack slide for your dishwasher. It is mounted to each side of the upper cabinet wall. The dishrack wheels roll inside this track, which guides the upper rack. The mounting screws are not included in this purchase and can be found in the related parts section below. You should purchase a new dishrack slide if your current one has been warped or damaged over time."
  },
  {
    "id": "PS8747441-install",
    "part_number": "PS8747441",
    "title": "CUTLERY DRAWER 00770657",
    "url": "https://www.partselect.com/PS8747441-Bosch-00770657-CUTLERY-DRAWER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS8729301-install",
    "part_number": "PS8729301",
    "title": "Dishwasher Handlecap Shaped 00628998",
    "url": "https://www.partselect.com/PS8729301-Bosch-00628998-Dishwasher-Handlecap-Shaped.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door handle end cap is supplied directly by the manufacturer for use with dishwashers. It is a genuine OEM part that is designed to fit just like the original piece. The end cap is made of highly durable plastic, and it is responsible for securing the end of the handle on the dishwasher door. It protects the handle from scratches, dents, and general wear and tear, which can occur over time. It also contributes to the appearance of the dishwasher by concealing any exposed screws and providing a finished look to the handles. When replacing the end caps, you will need to first remove the door panel. Each end cap is sold individually."
  },
  {
    "id": "PS17219715-install",
    "part_number": "PS17219715",
    "title": "HANDLE,TUG LATCH,BLACK 5304535626",
    "url": "https://www.partselect.com/PS17219715-Frigidaire-5304535626-HANDLE-TUG-LATCH-BLACK.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11758453-install",
    "part_number": "PS11758453",
    "title": "Door Handle - Silver 12012913",
    "url": "https://www.partselect.com/PS11758453-Bosch-12012913-Door-Handle-Silver.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a door handle, which is is installed at the top of your dishwasher door and allows you to open and close it. However, if this part is missing or broken, the opening and closing your dishwasher will be more difficult, and the overall visual appearance will be less pleasing. Replacing this door handle will require a Phillips-head and flat-head screwdriver, as well as a set of pliers, and some disassembly of your dishwasher will be necessary. This door handle is an individual OEM part and does not come with any other accessories for your dishwasher."
  },
  {
    "id": "PS2360984-install",
    "part_number": "PS2360984",
    "title": "Dishwasher Bimetal Fuse W10258275",
    "url": "https://www.partselect.com/PS2360984-Whirlpool-W10258275-Dishwasher-Bimetal-Fuse.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is used as a safety device to protect the dishwasher circuit from overload. If the temperature gets to high it will shut off the electrical current to the heating unit in the appliance. Also known as Thermal Fuse."
  },
  {
    "id": "PS4704481-install",
    "part_number": "PS4704481",
    "title": "Dishwasher Thermal Fuse W10402110",
    "url": "https://www.partselect.com/PS4704481-Whirlpool-W10402110-Dishwasher-Thermal-Fuse.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a replacement thermal fuse for your dishwasher. The thermal fuse is sometimes known as the thermal cutoff. The thermal fuse shuts off the dishwasher if the dishwasher shorts out or overheats. If your dishwasher is cutting out during the cycle, or will not start, you may have an issue with your thermal fuse. If your dishwasher control panel does not light up, the first thing you should check is the fuse. Before you begin to repair this part, be sure to disconnect the dishwasher from the power source, as you will be working around electricity."
  },
  {
    "id": "PS774514-install",
    "part_number": "PS774514",
    "title": "Dishwasher Fuse Kit 8193762",
    "url": "https://www.partselect.com/PS774514-Whirlpool-8193762-Dishwasher-Fuse-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "When replacing these fuses the wire harness must be replaced as well. It is located in the control panel. The harness is included with this part now."
  },
  {
    "id": "PS16219732-install",
    "part_number": "PS16219732",
    "title": "BLACK TOE KICK WD27X27752",
    "url": "https://www.partselect.com/PS16219732-GE-WD27X27752-BLACK-TOE-KICK.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Enhance your appliance's appearance with the Black Toe Kick Plate from GE. This toe kick plate is designed to complement your appliance seamlessly, providing an attractive finish around the bottom edge of your appliances. The durable black finish ensures lasting beauty and resilience, providing a professional look that adds to your kitchen's aesthetic. Easy to install, this toe kick plate is manufactured by GE, guaranteeing the best quality and perfect compatibility with your appliance. Upgrade your appliance today and enjoy its renewed beauty and function."
  },
  {
    "id": "PS11747779-install",
    "part_number": "PS11747779",
    "title": "Dishwasher Bezel WP99003605",
    "url": "https://www.partselect.com/PS11747779-Whirlpool-WP99003605-Dishwasher-Bezel.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is an inlet/outlet bezel, also known as the air duct bezel, is for your dishwasher. It covers the vent openings in the dishwasher and prevents the dishwasher from leaking. It is gray in color and is approximately 4 inches in diameter. If the bezel is damaged, or the tabs holding in place are broken, you may need to replace it. Many of our customers have described this repair as easy. This is an authentic OEM part sourced directly from the manufacturer."
  },
  {
    "id": "PS3633191-install",
    "part_number": "PS3633191",
    "title": "Kickplate Grille (Black) 154745503",
    "url": "https://www.partselect.com/PS3633191-Frigidaire-154745503-Kickplate-Grille-Black.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This kickplate grille is attached to the bottom of the dishwasher."
  },
  {
    "id": "PS16746079-install",
    "part_number": "PS16746079",
    "title": "INSULATING PART 11050210",
    "url": "https://www.partselect.com/PS16746079-Bosch-11050210-INSULATING-PART.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12070612-install",
    "part_number": "PS12070612",
    "title": "Dishwasher Tub Sound Shield Insulation W11086533",
    "url": "https://www.partselect.com/PS12070612-Whirlpool-W11086533-Dishwasher-Tub-Sound-Shield-Insulation.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the Whirlpool Tub Sound Shield - an essential piece for maintaining the tranquility of your kitchen. Acting as an effective sound barrier, it significantly muffles the operating noise of your dishwasher, ensuring a quieter, more peaceful environment. This genuine Whirlpool OEM part is compatible with various models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef dishwashers. Please be advised, it is crucial to verify the compatibility of this part with your model before ordering, as small variations in size and shape may exist. Always remember to shut off your dishwasher or home circuit breaker before installation and wear suitable work gloves to protect your hands. Enjoy a more serene kitchen with the Whirlpool Tub Sound Shield!"
  },
  {
    "id": "PS16746088-install",
    "part_number": "PS16746088",
    "title": "INSULATING PART 12040672",
    "url": "https://www.partselect.com/PS16746088-Bosch-12040672-INSULATING-PART.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS8714198-install",
    "part_number": "PS8714198",
    "title": "On/Off Button - Black 00427746",
    "url": "https://www.partselect.com/PS8714198-Bosch-00427746-On-Off-Button-Black.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS264113-install",
    "part_number": "PS264113",
    "title": "Dishwasher Door Latch Knob WD9X351",
    "url": "https://www.partselect.com/PS264113-GE-WD9X351-Dishwasher-Door-Latch-Knob.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This knob is attached to the dishwasher door latch mechanism."
  },
  {
    "id": "PS258820-install",
    "part_number": "PS258820",
    "title": "Dishwasher Timer Knob WD09X10024",
    "url": "https://www.partselect.com/PS258820-GE-WD09X10024-Dishwasher-Timer-Knob.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing a Genuine Replacement Dishwasher Timer Knob exclusively from the trusted brand, General Electric (GE). This superior-quality Timer Knob is specifically designed for your dishwasher, providing you with the flexibility to select the desired washing cycle. It is essential to unplug your dishwasher prior to installing this hardware. Crafted with precision, this Timer Knob exemplifies GE's commitment towards providing reliable and durable parts for your home appliances. Maximize the functionality and performance of your dishwasher with this essential GE Timer Knob."
  },
  {
    "id": "PS12740668-install",
    "part_number": "PS12740668",
    "title": "Brake Up Case DD61-00655A",
    "url": "https://www.partselect.com/PS12740668-Samsung-DD61-00655A-Brake-Up-Case.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS9606454-install",
    "part_number": "PS9606454",
    "title": "Brake Case Assembly DD94-01091C",
    "url": "https://www.partselect.com/PS9606454-Samsung-DD94-01091C-Brake-Case-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS9606365-install",
    "part_number": "PS9606365",
    "title": "Foot DD61-00331B",
    "url": "https://www.partselect.com/PS9606365-Samsung-DD61-00331B-Foot.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Optimize your kitchen with the genuine Samsung Foot Free Standing. Designed specifically for select Samsung dishwashers, this product levels your appliance, ensuring optimal performance. It serves as a sturdy and reliable base that bolsters durability, effectively resisting wear and tear over an extended period. The sleek, contemporary design adds a sophisticated touch to your kitchen ambiance. Moreover, installation is smoothly managed by disconnecting the dishwasher and water supply beforehand. Remember to use work gloves for protection during this process, securing your Samsung appliance's long-lasting functionality, style, and success."
  },
  {
    "id": "PS12741853-install",
    "part_number": "PS12741853",
    "title": "Vent Asmy Blower 5304523304",
    "url": "https://www.partselect.com/PS12741853-Frigidaire-5304523304-Vent-Asmy-Blower.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is located behind the kickplate. The blower vent assembly opens during the drying cycle to release moisture."
  },
  {
    "id": "PS11748136-install",
    "part_number": "PS11748136",
    "title": "Air Inlet WPW10077883",
    "url": "https://www.partselect.com/PS11748136-Whirlpool-WPW10077883-Air-Inlet.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Also known as an air baffle."
  },
  {
    "id": "PS11745487-install",
    "part_number": "PS11745487",
    "title": "Dishwasher Air Inlet WP8268937",
    "url": "https://www.partselect.com/PS11745487-Whirlpool-WP8268937-Dishwasher-Air-Inlet.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is located at the bottom of the door. It helps to circulate air during the drying process."
  },
  {
    "id": "PS16660524-install",
    "part_number": "PS16660524",
    "title": "HARNS-WIRE W11568793",
    "url": "https://www.partselect.com/PS16660524-Whirlpool-W11568793-HARNS-WIRE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12170953-install",
    "part_number": "PS12170953",
    "title": "HARNESS Assembly JUMPER WD21X23559",
    "url": "https://www.partselect.com/PS12170953-GE-WD21X23559-HARNESS-Assembly-JUMPER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introduce your GE dishwasher to an upgrade with this Jumper Wire Harness. An essential piece for dishwashers, this component acts as a crucial intermediary, transferring electrical signals between two points in a circuit. Remember, it's always advised to disconnect the power supply to your dishwasher or engage the circuit breaker before getting started with the installation process. As an added tip for your safety, make sure to don work gloves to safeguard your hands from any potential harm during implementation. Equip your kitchen's trusted companion with the Harness Assembly Jumper, a product designed with quality and efficiency that you'd expect from a reliable brand like GE."
  },
  {
    "id": "PS11759017-install",
    "part_number": "PS11759017",
    "title": "HARNESS Assembly DOOR WD21X22916",
    "url": "https://www.partselect.com/PS11759017-GE-WD21X22916-HARNESS-Assembly-DOOR.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Upgrade your dishwasher with the GE Door Wire Harness Assembly. Designed for durability and seamless integration, this door assembly harness ensures that all components of your dishwasher door connect effectively to the electrical circuits, enhancing performance and reliability. Before beginning the installation process, it's important that you unplug the dishwasher or switch off your home's circuit breaker to ensure your safety. We also advise that you wear work gloves during this process to protect your hands. This Harness Assembly Door from GE guarantees to make your dishwasher operate at optimum efficiency. Experience improved functionality with this essential GE appliance part."
  },
  {
    "id": "PS17626228-install",
    "part_number": "PS17626228",
    "title": "TIMER WD21X33641",
    "url": "https://www.partselect.com/PS17626228-GE-WD21X33641-TIMER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a timer for use in dishwashers. The timer is responsible for ensuring the various parts of the dishwasher cycle activate at the correct time. If the timer is in any way broken or faulty, it will cause your dishwasher to not start, take longer than normal or finish too early, and will need to be replaced as soon as possible. This timer features a mostly metal construction and features a wire terminal on its top side. Replacing this timer will require a few tools, like a screwdriver or socket wrench, and some disassembly of your dishwasher will be necessary. This timer is an individual OEM part, so it does not come with any accessories."
  },
  {
    "id": "PS17626226-install",
    "part_number": "PS17626226",
    "title": "TIMER WD21X33640",
    "url": "https://www.partselect.com/PS17626226-GE-WD21X33640-TIMER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS6011663-install",
    "part_number": "PS6011663",
    "title": "Dishwasher Timer WD21X10475",
    "url": "https://www.partselect.com/PS6011663-GE-WD21X10475-Dishwasher-Timer.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The timer manages the various dishwasher functions such as filling, washing, draining and drying."
  },
  {
    "id": "PS12582702-install",
    "part_number": "PS12582702",
    "title": "Trap Glass WD12X24663",
    "url": "https://www.partselect.com/PS12582702-GE-WD12X24663-Trap-Glass.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS8735532-install",
    "part_number": "PS8735532",
    "title": "DOOR-OUTER 00689412",
    "url": "https://www.partselect.com/PS8735532-Bosch-00689412-DOOR-OUTER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS8756120-install",
    "part_number": "PS8756120",
    "title": "Dishwasher Attach Strip WD01X10634",
    "url": "https://www.partselect.com/PS8756120-GE-WD01X10634-Dishwasher-Attach-Strip.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12741990-install",
    "part_number": "PS12741990",
    "title": "WATER INLET 11030996",
    "url": "https://www.partselect.com/PS12741990-Bosch-11030996-WATER-INLET.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Enhance the efficiency of your Bosch dishwasher with this genuine water inlet guide assembly. Ideal for directing fill water accurately into the dishwasher tub, this part assures optimal cleaning performance. As an authentic OEM part, it fits perfectly with certain models of Bosch, affirming its impeccable quality. Disconnection of the dishwasher or a switch off from the house circuit breaker is advised before installation. Always remember, work gloves can protect your hands during setup. Get this Bosch Water Inlet Guide Assembly to maintain the performance and longevity of your dishwasher."
  },
  {
    "id": "PS11746099-install",
    "part_number": "PS11746099",
    "title": "Dishwasher Water Deflector WP8528862",
    "url": "https://www.partselect.com/PS11746099-Whirlpool-WP8528862-Dishwasher-Water-Deflector.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is located in the lower front corners of the dishwasher tub. They keep the water away from the corners of the appliance and therefore eliminating the rush of water behind the door."
  },
  {
    "id": "PS8730292-install",
    "part_number": "PS8730292",
    "title": "WATER INLET 00645147",
    "url": "https://www.partselect.com/PS8730292-Bosch-00645147-WATER-INLET.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12729836-install",
    "part_number": "PS12729836",
    "title": "POWER CORD 12027214",
    "url": "https://www.partselect.com/PS12729836-Bosch-12027214-POWER-CORD.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS358548-install",
    "part_number": "PS358548",
    "title": "Dishwasher Power Cord Kit 4317824",
    "url": "https://www.partselect.com/PS358548-Whirlpool-4317824-Dishwasher-Power-Cord-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Includes power cord and all necessary parts needed for complete installation of cord."
  },
  {
    "id": "PS12745068-install",
    "part_number": "PS12745068",
    "title": "CORD-POWER W11365014",
    "url": "https://www.partselect.com/PS12745068-Whirlpool-W11365014-CORD-POWER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11747035-install",
    "part_number": "PS11747035",
    "title": "Blender Foot WP9709707",
    "url": "https://www.partselect.com/PS11747035-Whirlpool-WP9709707-Blender-Foot.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Sold individually."
  },
  {
    "id": "PS16762447-install",
    "part_number": "PS16762447",
    "title": "LEVELING LEG WD02X31882",
    "url": "https://www.partselect.com/PS16762447-GE-WD02X31882-LEVELING-LEG.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11770497-install",
    "part_number": "PS11770497",
    "title": "Leveling Leg 5304506540",
    "url": "https://www.partselect.com/PS11770497-Frigidaire-5304506540-Leveling-Leg.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Sold individually."
  },
  {
    "id": "PS8768382-install",
    "part_number": "PS8768382",
    "title": "SILICONE LIGHT PIPE WD21X20299",
    "url": "https://www.partselect.com/PS8768382-GE-WD21X20299-SILICONE-LIGHT-PIPE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Enhance the functionality of your dishwasher with this Silicone Light Pipe by GE. This specialized component guides light from the control board to the control display panel, offering clear and reliable access to your dishwasher's system status. Remember to disconnect power to your dishwasher before the installation process to maintain safety. It's also advised to wear suitable work gloves to protect your hands while handling this part. Trust in this premium-quality Silicone Light Pipe from GE to revamp your appliance's performance."
  },
  {
    "id": "PS11771968-install",
    "part_number": "PS11771968",
    "title": "SILICONE LIGHT PIPE WD12X23316",
    "url": "https://www.partselect.com/PS11771968-GE-WD12X23316-SILICONE-LIGHT-PIPE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This premium dishwasher part from GE, of the highest quality, is a Silicone Light Pipe designed for optimum performance. This advanced component transmits light from the control board directly to the control display panel, ensuring smooth operation. Known for its durability, it is pivotal to achieving the best performance from your appliance. Though proficient DIY skills are advisable, installation is straightforward yet considerable care is advised. Be sure to disconnect your dishwasher from power supply before installation and use protective gloves for safety. Trust in the proven reliability of GE and enhance the longevity of your dishwasher today."
  },
  {
    "id": "PS8756259-install",
    "part_number": "PS8756259",
    "title": "SILICONE LIGHT PIPE WD12X20139",
    "url": "https://www.partselect.com/PS8756259-GE-WD12X20139-SILICONE-LIGHT-PIPE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS16742696-install",
    "part_number": "PS16742696",
    "title": "TUB TRIMS KIT WD01X31618",
    "url": "https://www.partselect.com/PS16742696-GE-WD01X31618-TUB-TRIMS-KIT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Revitalize your GE appliance with this high-quality Tub Trims Kit. This kit is manufactured by GE, ensuring it's designed with your appliance's specifications in mind for the perfect fit and functionality. The Tub Trims Kit is essential in maintaining the overall condition and performance of your appliance, aiding in ensuring a longer lifespan and efficient functioning. This durable kit is easy to install and designed for the rigors of daily use. Enhance your appliance's performance today with this excellent GE Tub Trims Kit. Your GE appliance deserves nothing less than the best."
  },
  {
    "id": "PS16659466-install",
    "part_number": "PS16659466",
    "title": "BLACK TUB TRIM WD01X29479",
    "url": "https://www.partselect.com/PS16659466-GE-WD01X29479-BLACK-TUB-TRIM.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Enhance the aesthetic and functionality of your kitchen appliance with GE's black tub trim. Designed to offer a sleek and polished finish, this component is ideal to uphold the integrity and longevity of various appliances. Developed with GE's trademark precision, the black tub trim is easy-to-install and guarantees a flawless and stylish look. Keep your appliance in top shape and maintain its modern appeal with this sturdy, durable, and attractive tub trim. Trust GE for delivering superior product quality, enhancing your appliance's life and performance."
  },
  {
    "id": "PS16742698-install",
    "part_number": "PS16742698",
    "title": "TUB TRIMS KIT WD01X31858",
    "url": "https://www.partselect.com/PS16742698-GE-WD01X31858-TUB-TRIMS-KIT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is the replacement tub trim for your dishwasher. It is approximately 26 inches long and 2 inches wide. The tub trim is found on the exterior of the dishwasher, and the main reason you would want to replace it is if it is cracked, worn, or damaged. This tub trim is sold individually and is an OEM part sourced directly from the manufacturer."
  },
  {
    "id": "PS11775863-install",
    "part_number": "PS11775863",
    "title": "ACCESSORY ASSEMBLY 5001DD4001C",
    "url": "https://www.partselect.com/PS11775863-LG-5001DD4001C-ACCESSORY-ASSEMBLY.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This installation brackets kit is for installing and securing your dishwasher to the surrounding cabinets or under the countertop to prevent movement or tilting during operation. These silver brackets are usually located at the top or sides of the dishwasher, where they are screwed into the underside of the countertop or the sides of the cabinets. If one of these brackets is broken or missing, you may notice your dishwasher shifting or vibrating excessively during use, or it might not sit level. This is a genuine OEM kit."
  },
  {
    "id": "PS11771969-install",
    "part_number": "PS11771969",
    "title": "ATTACHMENT STRIP TOP WD13X22837",
    "url": "https://www.partselect.com/PS11771969-GE-WD13X22837-ATTACHMENT-STRIP-TOP.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12085776-install",
    "part_number": "PS12085776",
    "title": "Assembly ACCESSORY;DW9900H,DW8000J,COMMON,WA DD98-01051B",
    "url": "https://www.partselect.com/PS12085776-Samsung-DD98-01051B-Assembly-ACCESSORY-DW9900H-DW8000J-COMMON-WA.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS16875933-install",
    "part_number": "PS16875933",
    "title": "CAPACITOR W11662065",
    "url": "https://www.partselect.com/PS16875933-Whirlpool-W11662065-CAPACITOR.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11753080-install",
    "part_number": "PS11753080",
    "title": "Dishwasher Capacitor WPW10334457",
    "url": "https://www.partselect.com/PS11753080-Whirlpool-WPW10334457-Dishwasher-Capacitor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "250 max Volt, 23.5 MFD."
  },
  {
    "id": "PS8714362-install",
    "part_number": "PS8714362",
    "title": "CAPACITER-INTERFERENCE 00429052",
    "url": "https://www.partselect.com/PS8714362-Bosch-00429052-CAPACITER-INTERFERENCE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS6447742-install",
    "part_number": "PS6447742",
    "title": "BADGE GE Assembly WR04X10181",
    "url": "https://www.partselect.com/PS6447742-GE-WR04X10181-BADGE-GE-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12348533-install",
    "part_number": "PS12348533",
    "title": "Plate W11178521",
    "url": "https://www.partselect.com/PS12348533-Whirlpool-W11178521-Plate.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the Whirlpool NAMEPLATE, a genuine OEM part tailored to work with various Whirlpool models. Specifically designed for ranges, this nameplate prominently displays the prestigious Whirlpool brand name, reaffirming the quality and reliability of your appliance. Please ensure your model's compatibility with the NAMEPLATE before purchasing. As some parts may appear identical, be aware that there can be minor variations in size and shape. Enjoy enhancing your appliance with this finely-crafted part. Trust Whirlpool for all your appliances needs."
  },
  {
    "id": "PS11769728-install",
    "part_number": "PS11769728",
    "title": "Plate W10909682",
    "url": "https://www.partselect.com/PS11769728-Whirlpool-W10909682-Plate.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This genuine Whirlpool NAMEPLATE is ideally designed for specific Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef models, reflecting the reliability and uncompromising quality of Whirlpool. The critical role of this NAMEPLATE is to showcase the brand name on the appliance, enhancing its aesthetic appeal. Although many parts might appear similar, subtle differences in size and shape often exist, hence the necessity to cross-check the correctness of your model before placing an order. Utilize the W10909682 NAMEPLATE to restore the original look of your appliance and uphold its brand value. With this high-grade NAMEPLATE, your appliance will maintain the brand aesthetic and serve you with the expected Whirlpool durability. Embrace this vital Whirlpool component for a swift, hassle-free, and dependable solution to your appliance nameplate needs."
  },
  {
    "id": "PS12364199-install",
    "part_number": "PS12364199",
    "title": "Refrigerator Door Shelf Bin 242126602",
    "url": "https://www.partselect.com/PS12364199-Frigidaire-242126602-Refrigerator-Door-Shelf-Bin.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This manufacturer-certified Refrigerator Door Shelf Bin, also known as a crisper bin or door shelf bin, is made of clear plastic, and is easy to install. It is used to hold items in the fridge, like jars, cans, and condiments and you'll be able to visually see if the part is broken or cracked. This particular shelf attaches to the fridge door. You can check if this model is right for your appliance by checking your user manual and model number. This part should simply snap into place without the need for any tools as part of the repair. Just carefully line up the slots on the door with the slots on the bin and slide the bin down to completely lock it into place. The part is sold individually, and fits many different types of side-by-side refrigerators."
  },
  {
    "id": "PS734935-install",
    "part_number": "PS734935",
    "title": "Door Shelf Retainer Bar 240534901",
    "url": "https://www.partselect.com/PS734935-Frigidaire-240534901-Door-Shelf-Retainer-Bar.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door shelf retaining bar, also known as refrigerator door bar retainer or fridge door rack, is a genuine part sourced from the original manufacturer. It is a white This manufacturer-certified Door Shelf Retainer Bar, sometimes otherwise known as the door rack or bar retainer, is a white, plastic part which can be easily installed onto the inside of the refrigerator or freezer door to hold items on the door shelves. It holds items in your fridge and will show physical damage if broken or warped, at which time it should be replaced. Check your user manual and model number to see if this part is right for you. No tools are required for this installation, the part should simply snap into place. This part measures roughly 25 inches wide, 3 inches high, and 5 inches deep. This part is sold individually, and we recommend checking the other door shelf retaining bars on your refrigerator or freezer at the same time as ordering this part to ensure that no others need to be replaced, as they often wear or warp at similar speeds."
  },
  {
    "id": "PS734936-install",
    "part_number": "PS734936",
    "title": "Door Shelf Retainer Bar 240534701",
    "url": "https://www.partselect.com/PS734936-Frigidaire-240534701-Door-Shelf-Retainer-Bar.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The Door Shelf Retainer Bar, also known as a refrigerator door rack, is a white, plastic part which can be easily installed onto your fridge door. It holds items in your fridge and will show physical damage if broken, at which time it should be replaced. Check your user manual and model number to see if this part is right for you. To install this part, you will need to remove the old one by unlocking the tabs, which can be slid with your fingers. To install the new shelf, line it up with the shelf cut-outs, over the tabs, and gently press it down to lock it into place. This part generally fits the middle door shelf of refrigerators. This is a part that frequently requires multiple parts per refrigerator. Because it is sold individually, you will need to purchase as many door racks as necessary to complete your repair."
  },
  {
    "id": "PS430917-install",
    "part_number": "PS430917",
    "title": "Drawer Support Rail (Right Side) 240530701",
    "url": "https://www.partselect.com/PS430917-Frigidaire-240530701-Drawer-Support-Rail-Right-Side.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This manufacturer-certified drawer support rail supports the right side of the sliding drawer. It is a track that helps the drawer slide open and closed with ease. If you are having trouble opening or closing your fresh food drawer, check the support rails for any blockage, or visible damage. If the rail is damaged, it should be replaced to ensure no further damage is done to the drawer itself. The repair is straightforward: unscrew and remove the existing support rail, then fasten the new rail in place. This genuine OEM replacement part is made of plastic and is white in color. NOTE: This part is sold separately from the left side drawer support rail. The part measures approximately 16 inches long by 1 inch high."
  },
  {
    "id": "PS11739119-install",
    "part_number": "PS11739119",
    "title": "Refrigerator Crisper Drawer w/Humidity Control WP2188656",
    "url": "https://www.partselect.com/PS11739119-Whirlpool-WP2188656-Refrigerator-Crisper-Drawer-w-Humidity-Control.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The crisper drawer (Crisper Pan, Refrigerator Crisper Drawer) with humidity control is meant to keep your vegetables and fruit as fresh as possible by allowing you to regulate the humidity levels within the drawer. It attaches on the inside of your refrigerator to the bottom of the crisper shelf. This drawer can break from misuse or accidental damage. It is also subject to material fatigue over time. If broken or damaged, it may be difficult to slide the drawer in and out, and it should be replaced. This plastic drawer measures 14.92 inches long, 7.6 inches high, and 16.5 inches wide and comes in white/clear."
  },
  {
    "id": "PS429854-install",
    "part_number": "PS429854",
    "title": "Refrigerator Crisper Pan 240337103",
    "url": "https://www.partselect.com/PS429854-Frigidaire-240337103-Refrigerator-Crisper-Pan.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This manufacturer-certified Refrigerator Crisper Pan is a clear plastic pan which easily inserts into your fridge's crisper area in order to hold items. In some models of refrigerator this model is the same pan for both the meat and vegetable bins, but please note that this part is sold individually and not part of a complete kit. If broken then the part should be replaced. Refer to your user manual and model number to see if this crisper is right for your fridge. This bin measures approximately 11 inches deep and 22 inches long."
  },
  {
    "id": "PS11704498-install",
    "part_number": "PS11704498",
    "title": "Refrigerator Water Filter EPTWFU01",
    "url": "https://www.partselect.com/PS11704498-Frigidaire-EPTWFU01-Refrigerator-Water-Filter.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This OEM refrigerator filter is for french door and side-by-side door types and is located in the back, top-right of your appliance. By absorbing heavy metals, pharmaceuticals, pesticides, chlorine, and much more, this filter provides delicious and healthy drinking water. This filter measures 2 inches deep, 9 inches high, 2 inches wide, and weighs 0.9 lbs. The installation is quick and easy with a push and twist feature. Don't forget to run water through the dispenser for about three minutes or 1.5 gallons to prepare the filter before use. For best performance replace this filter every six months."
  },
  {
    "id": "PS11701542-install",
    "part_number": "PS11701542",
    "title": "Refrigerator Everydrop Ice & Water Filter EDR1RXD1",
    "url": "https://www.partselect.com/PS11701542-Whirlpool-EDR1RXD1-Refrigerator-Everydrop-Ice-Water-Filter.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The EDR1RXD1 water filter provides clean, fresh-tasting water by reducing contaminants such as lead, chlorine, and particulates. Designed for easy installation, this filter ensures your refrigerator water and ice are safe and refreshing with every use"
  },
  {
    "id": "PS16218782-install",
    "part_number": "PS16218782",
    "title": "Filter FPPWFU01",
    "url": "https://www.partselect.com/PS16218782-Frigidaire-FPPWFU01-Filter.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The PurePour water filter keeps your Frigidaire refrigerator’s water clean and fresh. Designed for models with a ceiling-mounted cylindrical filter, it’s an easy, genuine replacement for safe and great-tasting drinking water."
  },
  {
    "id": "PS11738120-install",
    "part_number": "PS11738120",
    "title": "Refrigerator Ice Maker W10873791",
    "url": "https://www.partselect.com/PS11738120-Whirlpool-W10873791-Refrigerator-Ice-Maker.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This ice maker is for refrigerators. Ice maker includes the ice mold and the control device. The ice maker receives water from the water inlet valve and then holds the water in the ice mold until the water freezes solid. It then automatically ejects the ice and refills to continue the process until the ice storage in is full. Safely store any food that could deteriorate while the power is off and unplug the refrigerator when installing this part. Wear work gloves to protect your hands."
  },
  {
    "id": "PS12364147-install",
    "part_number": "PS12364147",
    "title": "Refrigerator Ice Maker Assembly 241798231",
    "url": "https://www.partselect.com/PS12364147-Frigidaire-241798231-Refrigerator-Ice-Maker-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This 8-cube ice maker is used to create ice for your refrigerator. The ice maker receives water from the water inlet valve and will freeze until ice cubes are formed. Once the water has been frozen the cubes will be ejected from the mold in to the ice bucket. The ice maker will continue the process until the ice bucket has reached the limit. If your ice maker is not making ice you may need to replace this part. Please remember to disconnect the power and water supply before starting your repair. This ice maker is a genuine OEM part."
  },
  {
    "id": "PS11765620-install",
    "part_number": "PS11765620",
    "title": "Refrigerator Ice Maker Assembly W10884390",
    "url": "https://www.partselect.com/PS11765620-Whirlpool-W10884390-Refrigerator-Ice-Maker-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is an ice maker assembly for various models of refrigerator. This ice maker assembly is used to freeze and eject ice into the ice bucket, then dispense the ice. This ice maker comes with the necessary shut-off arm, as well as a wire harness to properly install it into the freezer compartment of your refrigerator. If your current ice maker is either not producing ice or not breaking the ice up properly, it will need to be replaced. This ice maker assembly is an OEM part and is sold on its own, without any other parts or accessories."
  },
  {
    "id": "PS9493819-install",
    "part_number": "PS9493819",
    "title": "Refrigerator Door Gasket (White) 242193206",
    "url": "https://www.partselect.com/PS9493819-Frigidaire-242193206-Refrigerator-Door-Gasket-White.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is an OEM door gasket, also known as a door seal, for various refrigerators. A door gasket is used to create a barrier between the warmer, ambient temperature of your home, and the cooler interior of the refrigerator. But if used for a long period of time, or simply after general wear and tear, this gasket can tear, break, and/or warp. If your gasket is broken, warped, or moldy, it will need to be replaced immediately. To replace this gasket, carefully peel out the old gasket and discard it, then carefully wrap the new gasket around the frame of the fridge door to install it. This door gasket is white and rectangular and measures 28.5 inches long, .75 inches thick, and approximately 42 inches wide. This door gasket is sold individually and does not come with any other parts or accessories."
  },
  {
    "id": "PS11759515-install",
    "part_number": "PS11759515",
    "title": "Door Gasket (Gray) W10830162",
    "url": "https://www.partselect.com/PS11759515-Whirlpool-W10830162-Door-Gasket-Gray.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door gasket is used to seal the refrigerator door when closed to keep the cool air inside and the room air out."
  },
  {
    "id": "PS7784009-install",
    "part_number": "PS7784009",
    "title": "Refrigerator Door Gasket 242193213",
    "url": "https://www.partselect.com/PS7784009-Frigidaire-242193213-Refrigerator-Door-Gasket.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Upgrade your refrigerator's performance with this genuine OEM gasket-door ref. 21 in white from Frigidaire. Designed to prevent warm air from invading your fridge, this door gasket guarantees a seamless seal to maintain optimum cooling efficiency. This is perfect to replace part models in certain Frigidaire, Electrolux, White Westinghouse, and Tappan models. Its size measures a standard 21 inches. For trouble-free installation, smooth any folds and creases on the gasket by soaking it in warm water or gently warming it with a hairdryer on low heat. Do remember to safely store any perishables while the door is open during installation."
  },
  {
    "id": "PS16619453-install",
    "part_number": "PS16619453",
    "title": "Fastener Handle Assembly WR01X39781",
    "url": "https://www.partselect.com/PS16619453-GE-WR01X39781-Fastener-Handle-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is the replacement door handle fastener for your refrigerator. It is made of white plastic and metal, is sold individually, and measures approximately 1-1/4 inches by 1 inch. The door handle fastener allows you to connect your door handle to the refrigerator door. If your door handle is loose or missing, this is the part that will replace it. This part is an authentic OEM part sourced directly from the manufacturer."
  },
  {
    "id": "PS11746909-install",
    "part_number": "PS11746909",
    "title": "Dryer Retaining Ring WP9703438",
    "url": "https://www.partselect.com/PS11746909-Whirlpool-WP9703438-Dryer-Retaining-Ring.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is a retaining ring, sometimes called a retaining clip, that holds the drum support roller onto the shaft of a dryer. It is made entirely of metal and measures less than an inch in diameter. The retaining ring is a genuine OEM part sourced directly from the manufacturer. The ring may vary in appearance due to manufacturer substitution, but the function is the same. You may need to replace this part if the dryer is noisy during tumbling, will not tumble, or takes too long to dry. Be sure to check drum support roller kit and shaft before ordering parts."
  },
  {
    "id": "PS963756-install",
    "part_number": "PS963756",
    "title": "Refrigerator Fan Grommet WR02X12008",
    "url": "https://www.partselect.com/PS963756-GE-WR02X12008-Refrigerator-Fan-Grommet.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "If you notice that your refrigerator or freezer is noisy or too warm, you may need to replace the evaporator fan grommet. This part is red in color, and is about 1 inch in diameter. The evaporator fan grommet is located behind the evaporator fan cover in the back of the freezer. You will need to remove the evaporator fan cover to access the evaporator fan and complete this repair. Before you begin this repair, ensure the power to the refrigerator is disconnected. You will need a pair of needle nose pliers, a small flat blade screw driver and both a 1/4 and 5/16-inch nut driver to complete this repair."
  },
  {
    "id": "PS217532-install",
    "part_number": "PS217532",
    "title": "Light Bulb (40W) 40A15",
    "url": "https://www.partselect.com/PS217532-GE-40A15-Light-Bulb-40W.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This 40-Watt light bulb is sold individually and is a genuine OEM replacement option for your home appliances. It is specially designed to withstand extreme temperatures, so this bulb is compatible with a variety of appliance types including refrigerators, ranges, microwaves, and dryers. It features a frosted glass bulb with a standard metal socket base, which allows you to easily unscrew the burnt-out light and twist the new bulb into place. Depending on your appliance, there may be a guard or cover protecting the lightbulb, in which case you may require additional tools to remove the cover. We recommend disconnecting the power supply to your appliance before changing the lightbulb."
  },
  {
    "id": "PS16555201-install",
    "part_number": "PS16555201",
    "title": "LED Light Module W11527432",
    "url": "https://www.partselect.com/PS16555201-Whirlpool-W11527432-LED-Light-Module.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is an LED light module designed for use in refrigerators. This module features an LED light panel that is secured to the top portion of your refrigerator cabinet and shines light down when you open the appliance. If your current LED light is not turning on and/or is flickering or working intermittently, it needs to be replaced. Replacing this LED light panel is simple as it features a single power cable harness that connects inside your fridge, and a single screw to secure it. This LED light panel is sold individually and does not come with any other parts, such as its securing screw."
  },
  {
    "id": "PS12751166-install",
    "part_number": "PS12751166",
    "title": "Light Bulb 316538904",
    "url": "https://www.partselect.com/PS12751166-Frigidaire-316538904-Light-Bulb.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This OEM 40 watt appliance light bulb is used for some ranges, refrigerators, freezers, and microwaves. Simply locate the existing bulb, unscrew it from its socket, and replace with new light bulb. If the existing bulb is broken in the socket, disconnect the power to the refrigerator and use a pair of needle nose pliers to grip the internal fragments of the bulb to unscrew. Replace with the new bulb and reconnect the power to the refrigerator. These bulbs are sold individually and are a commonly replaced part; consider ordering a spare."
  },
  {
    "id": "PS2358752-install",
    "part_number": "PS2358752",
    "title": "Upper Or Lower Mullion Hinge Pin 241779401",
    "url": "https://www.partselect.com/PS2358752-Frigidaire-241779401-Upper-Or-Lower-Mullion-Hinge-Pin.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This mullion hinge pin is a genuine OEM replacement part, measuring 1.5 inches by 1.25 inches by 0.85 inches. It is specially designed to secure the mullion in refrigerators, allowing it to pivot and ensure smooth door movement. The mullion acts as a barrier between the refrigerator and freezer to maintain the desired temperatures for each section. A damaged or loose hinge pin will result in temperature fluctuations, frost buildup along the door edges, and difficulties opening and closing the door. Therefore, it is important that you replace the pin as soon as it is no longer functioning. Note that your appliance may require two hinge pins, one near the top of the mullion and one near the bottom. Remove the mullion cover, detach the hinge pin, and install a the new one into the hinge assembly. Place the cover back on and verify that the hinge assembly is working by carefully opening and closing the refrigerator doors to check that they are moving smoothly. Each sold individually."
  },
  {
    "id": "PS11739042-install",
    "part_number": "PS11739042",
    "title": "Refrigerator Lower Door Closing Cam WP2182179",
    "url": "https://www.partselect.com/PS11739042-Whirlpool-WP2182179-Refrigerator-Lower-Door-Closing-Cam.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The lower door closing cam is used in refrigerator doors, it can be located on the fresh food side or the freezer side. It helps hold the door open. This cam is made out of plastic, so it might crack or wear down over time. If your door will not open and close properly you may need to replace the door closing cam. To successfully install this part, you will need a 5/16 nut driver and a small flat blade screwdriver. Before you begin, unplug your appliance and disconnect the water supply. Lubricating this part may help with installation. This replacement part is sold individually. This part will fit both the left and right side of your refrigerator door. To make the repair, remove the top hinge cover, then the top hinge support. Lift the door from the bottom support and remove the old door cams. Replace the cams, using a little lubricant if necessary, and place the door back on the lower hinge support. Replace the top hinge support and your repair is complete!"
  },
  {
    "id": "PS11752991-install",
    "part_number": "PS11752991",
    "title": "Refrigerator Door Cam WPW10329686",
    "url": "https://www.partselect.com/PS11752991-Whirlpool-WPW10329686-Refrigerator-Door-Cam.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The Door Cam is a black plastic part which helps the door pivot shut while keeping the door and hinge in proper alignment. Lubricating this part upon installation may help it move easier. It attaches onto the door hinge and should be replaced if broken or if there is noticeable damage. Refer to your model number and user manual to ensure this is the correct part for you. To do this repair you will need a 5/6 nut driver, a 5/16 socket, and a ratchet. For safety purposes, do not forget to turn off your appliance before making this repair. Note that this piece is black, and as per the manufacturer requires a new screw to mount the door cam which is sold individually. Please also note that this is the closing cam for the lower door, and the upper door cam is sold as a separate kit."
  },
  {
    "id": "PS12728638-install",
    "part_number": "PS12728638",
    "title": "Refrigerator Door Switch W11384469",
    "url": "https://www.partselect.com/PS12728638-Whirlpool-W11384469-Refrigerator-Door-Switch.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Door switch turns the light off when you close the door."
  },
  {
    "id": "PS12731166-install",
    "part_number": "PS12731166",
    "title": "Door Switch W11396033",
    "url": "https://www.partselect.com/PS12731166-Whirlpool-W11396033-Door-Switch.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This light switch may also be known as a refrigerator door switch or a light switch kit, and is compatible with your refrigerator. The function of the refrigerator door switch is to turn on the light when your fridge door is open, and to make sure it is off when your refrigerator door is closed. The reason you would need to replace this part is if your light is not turning on when your door is open. For this repair, you will need a putty knife, and a small flat-blade screwdriver."
  },
  {
    "id": "PS16554876-install",
    "part_number": "PS16554876",
    "title": "LIGHT SWITCH WR23X37285",
    "url": "https://www.partselect.com/PS16554876-GE-WR23X37285-LIGHT-SWITCH.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS7784018-install",
    "part_number": "PS7784018",
    "title": "Refrigerator Water Inlet Valve 242252702",
    "url": "https://www.partselect.com/PS7784018-Frigidaire-242252702-Refrigerator-Water-Inlet-Valve.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The function of the Refrigerator Water Inlet Valve (Triple Solenoid Water-Valve, Water Valve, Water Inlet Valve, Refrigerator Water Inlet Valve Assembly) is to release water from the supply line when activated, and send it through to your water dispenser or ice maker in your refrigerator. The water inlet valve is located at the back of the refrigerator, and connects to the water supply. The valve can break from material fatigue or normal use. If your water inlet valve is malfunctioning, you could be getting a lack of water to the inside of your refrigerator. Your ice maker may not produce cubes or your water dispenser may not work. The water inlet valve must be replaced if the solenoids no longer have continuity or the valve has internal blockage. This valve measures approximately 7 inches long and 4.5 inches wide, and is constructed of plastic and metal. It comes in blue, and includes the valve and mounting bracket."
  },
  {
    "id": "PS16226572-install",
    "part_number": "PS16226572",
    "title": "WATER VALVE WITH GUARD WR57X33326",
    "url": "https://www.partselect.com/PS16226572-GE-WR57X33326-WATER-VALVE-WITH-GUARD.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This water inlet valve (Refrigerator Water Inlet Valve Assembly) supplies water to the ice maker and the water dispenser in your refrigerator. It is located at the back of the fridge, beneath the bottom panel. It is connected directly to 2 water supplies, a wiring harness, and your inlet water tube. This part is located at the back of the fridge, beneath the bottom panel. It is connected directly to 2 water supplies, a wiring harness, and your inlet water tube. Minerals and sediments can build up over time and cause a blockage in your inlet valve. They can also cause the valve to stick open, leading to an overflow of water. If this part is malfunctioning, water flow to your appliance could be compromised. Check for small ice cubes or a lack of ice cubes/water, as this is an obvious sign the part is damaged. The water inlet valve must be replaced if the solenoids no longer have continuity or the valve has internal blockage. Test your water inlet valve with a multimeter. You can test both the water dispenser side and the ice maker side. The part measures approximately 3 inches long and 2.75 inches wide and is constructed of plastic and metal. This replacement part features 1 dual inlet water valve with quick connections. It also has 1/4 and 5/16 John Guest fittings for the outlet lines and a 1/4 compression fitting for the inlet line."
  },
  {
    "id": "PS3497634-install",
    "part_number": "PS3497634",
    "title": "Refrigerator Water Inlet Valve W10408179",
    "url": "https://www.partselect.com/PS3497634-Whirlpool-W10408179-Refrigerator-Water-Inlet-Valve.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The water inlet valve (Refrigerator Water Inlet Valve Kit) provides water for the ice maker and water dispenser. This part is located at the back of the refrigerator, and connects to the water supply. If your water inlet valve is malfunctioning, you could be getting a lack of water to the inside of your refrigerator. Your ice maker may not produce cubes or your water dispenser may not work. This breakage can occur from material fatigue or normal use, and is a sign the part should be replaced soon. The water inlet valve must be replaced if the solenoids no longer have continuity or the valve has internal blockage. The part measures approximately 6.5 inches long and 3 inches wide and is constructed of plastic and metal. It comes in blue/green/red."
  },
  {
    "id": "PS12741350-install",
    "part_number": "PS12741350",
    "title": "Evaporator Fan Motor WR60X31522",
    "url": "https://www.partselect.com/PS12741350-GE-WR60X31522-Evaporator-Fan-Motor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This 115-volt 60Hz evaporator fan motor is located in the back of the freezer and circulates air over the refrigerator coils. These coils will convert the heat into cool air, which is then circulated. If the motor has failed, the freezer/refrigerator will become too warm because the fan motor is not circulating the cool air from the freezer into the refrigerator. This is a genuine OEM part. Please remember to disconnect the power to the appliance before starting your repair."
  },
  {
    "id": "PS3502361-install",
    "part_number": "PS3502361",
    "title": "Evaporator Fan Motor (115v) 297309000",
    "url": "https://www.partselect.com/PS3502361-Frigidaire-297309000-Evaporator-Fan-Motor-115v.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This evaporator fan motor is 115V. If you notice that your freezer is noisy or is too warm, you may need to replace the evaporator fan motor. This package comes with the evaporator fan motor itself, as well as a wire harness. The evaporator fan motor is in the back of the freezer, so you will need to remove your freezer shelves and the back panel before you can access it. The function of the evaporator fan motor is to circulate air over the coils. The coils convert the heat into cool air, which is then circulated. Be sure to remove the power source from the freezer before you begin this repair."
  },
  {
    "id": "PS12172983-install",
    "part_number": "PS12172983",
    "title": "Refrigerator Fresh Food Evaporator Fan Motor WR60X26866",
    "url": "https://www.partselect.com/PS12172983-GE-WR60X26866-Refrigerator-Fresh-Food-Evaporator-Fan-Motor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The Refrigerator Evaporator Fan Motor is an OEM replacement part for some GE refrigerators. It is responsible for circulating air over the evaporator coils, which are responsible for cooling the refrigerator's interior. Causes of a bad evaporator fan motor can include bearing failure, motor burnout due to overheating, or electrical issues. A malfunctioning fan motor can lead to temperature fluctuations, frost buildup, and ultimately, reduced cooling efficiency."
  },
  {
    "id": "PS469522-install",
    "part_number": "PS469522",
    "title": "Defrost Thermostat Kit 5303918214",
    "url": "https://www.partselect.com/PS469522-Frigidaire-5303918214-Defrost-Thermostat-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "If you find that there is excessive frost in your freezer, or the freezer will not defrost, you may need to replace the defrost thermostat. The defrost thermostat kit comes with the clip, leads, and heat shrink. To access the defrost thermostat for this repair, you will need to remove your freezer shelves, as well as the back panel of your freezer. To complete this repair, you will need a 1/4-inch nut driver, a set of wire strippers and crimpers, and a heat gun or blow dryer. Before you begin this repair, be sure to disconnect the power source from the appliance."
  },
  {
    "id": "PS8769007-install",
    "part_number": "PS8769007",
    "title": "Cold Control Thermostat 241537103",
    "url": "https://www.partselect.com/PS8769007-Frigidaire-241537103-Cold-Control-Thermostat.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This cold control thermostat cycles on and off regularly to keep your refrigerator cold."
  },
  {
    "id": "PS2350702-install",
    "part_number": "PS2350702",
    "title": "Defrost Thermostat 297216600",
    "url": "https://www.partselect.com/PS2350702-Frigidaire-297216600-Defrost-Thermostat.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This refrigerator defrost thermostat is a genuine OEM part and is sourced directly from the manufacturer. Located on the back wall of the freezer section in the refrigerator, the defrost thermostat is used to regulate the appliances temperature to keep the refrigerator cold and constant. The part is made of plastic, and has a 4 inch terminal on the white lead and a 6 inch terminal on the red lead. A refrigerator defrost thermostat may need to be replaced if the appliance is experiencing temperature related issues such as: too cold, too warm, frost buildup, not running, or running too long."
  },
  {
    "id": "PS12071178-install",
    "part_number": "PS12071178",
    "title": "Refrigerator Drawer Cover w/Glass 5304508761",
    "url": "https://www.partselect.com/PS12071178-Frigidaire-5304508761-Refrigerator-Drawer-Cover-w-Glass.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Crisper cover with glass works with some Frigidaire, Electrolux, White Westinghouse, and Tappan models of fridges. This is a genuine OEM part that works for some models of Frigidaire, Electrolux, White Westinghouse, and Tappan models."
  },
  {
    "id": "PS11723190-install",
    "part_number": "PS11723190",
    "title": "Refrigerator Pantry Drawer Lid W10827015",
    "url": "https://www.partselect.com/PS11723190-Whirlpool-W10827015-Refrigerator-Pantry-Drawer-Lid.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This pantry drawer lid is also known as a pantry drawer door or pantry drawer cover. This is a genuine OEM part, and is sold individually. This part helps keep everything inside the drawer. It acts as a cover, and also keeps your drawer at the proper temperature by creating a seal. You may need to replace this part if door does not open or close, or if the drawer is too cold. No tools are required for this replacement, simply push the hinge pins aside to remove the old lid. Consider checking the pantry end cap kit for damage before ordering the pantry drawer lid, as they are often purchased together."
  },
  {
    "id": "PS11723195-install",
    "part_number": "PS11723195",
    "title": "Refrigerator Pantry Lid W10827914",
    "url": "https://www.partselect.com/PS11723195-Whirlpool-W10827914-Refrigerator-Pantry-Lid.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is an OEM front cover for the pantry door of various refrigerator models. This cover is designed as a door that can cover the pantry compartment within your refrigerator and provide a transparent view of what is inside it. If this door is cracked, moldy, or missing, it needs to be replaced. This pantry door is made of durable white plastic and features a transparent window in the middle. This measures approximately 26 inches wide and 6 inches deep, and can be replaced by simply dislodging its securing tabs on the left and right side, and then inserting the new one into those same tabs. This pantry drawer cover is sold individually."
  },
  {
    "id": "PS11757023-install",
    "part_number": "PS11757023",
    "title": "Refrigerator Capacitor WPW10662129",
    "url": "https://www.partselect.com/PS11757023-Whirlpool-WPW10662129-Refrigerator-Capacitor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This capacitor (Refrigerator and Freezer Compressor Run Capacitor, Run Capacitor) provides the voltage or energy current required to start the compressor and keep it running. It allows the compressor in your appliance to easily cycle on and off. This capacitor mounts directly onto the compressor starting relay. If the capacitor is faulty the compressor may get unusually hot and draw excessive amperage. It the compressor overheats, it may fail to run until it cools down again. The compressor may also get noisy from overheating. If this part is totally electrically open, it is defective (often due to overheating) and needs to be replaced. The part measures 1 inch by 1-1/2 inches, and is constructed of plastic with two metal wire terminals. This item includes 1 capacitor, sold individually. This part comes in black."
  },
  {
    "id": "PS3495561-install",
    "part_number": "PS3495561",
    "title": "Run Capacitor (120v) 297286803",
    "url": "https://www.partselect.com/PS3495561-Frigidaire-297286803-Run-Capacitor-120v.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part helps the compressor kick on and off while maintaining a constant temperature to keep things frozen in your freezer. The run capacitor is attached to the compressor. This part is 120 volts and 15 mfd. The run capacitor helps the compressor kick on and off while maintaining a constant temperature to keep things frozen in your freezer. If your refrigerator is too warm, will not start, or your freezer section is too warm, you may need to replace this part. This is a genuine OEM part. Please remember to disconnect power to your refrigerator before starting your repair."
  },
  {
    "id": "PS2333670-install",
    "part_number": "PS2333670",
    "title": "Run Capacitor 5304464438",
    "url": "https://www.partselect.com/PS2333670-Frigidaire-5304464438-Run-Capacitor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The run capacitor helps the compressor kick on and off while maintaining a constant temperature in your fridge and freezer. You may need to replace your run capacitor if your refrigerator or freezer section will not start, if they are too warm, or if your refrigerator has become too noisy. Replacing the run capacitor is a relatively easy project. For this repair you will only need a 1/4 inch nut driver and needle nose pliers. Remember to disconnect the power and water supply line to the unit before you begin this repair. For full step by step instructions, simply click on the video below."
  },
  {
    "id": "PS17215831-install",
    "part_number": "PS17215831",
    "title": "Ice Maker Assembly W11658802",
    "url": "https://www.partselect.com/PS17215831-Whirlpool-W11658802-Ice-Maker-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The ice maker includes the ice mold and the control device. The ice maker receives water from the water inlet valve and then holds the water in the ice mold until the water freezes solid."
  },
  {
    "id": "PS11755733-install",
    "part_number": "PS11755733",
    "title": "Refrigerator Electronic Control Board WPW10503278",
    "url": "https://www.partselect.com/PS11755733-Whirlpool-WPW10503278-Refrigerator-Electronic-Control-Board.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The electronic control board is used in refrigerators to monitor and manage the temperature settings, such as cooling or defrosting times. If your fridge or freezer is too warm, too cold, is not defrosting, will not start, and/or runs too long then replacing the control board could solve your appliance problem. The tools needed for this installation project is a small flat blade screwdriver. *Please note: the board will need to be programmed after installation. Remember to unplug refrigerator from power source as a safety precaution. Refer to the manual provided by the manufacturer for further installation instructions and accurate guidance."
  },
  {
    "id": "PS423801-install",
    "part_number": "PS423801",
    "title": "Defrost Timer (60hz 120v) 215846602",
    "url": "https://www.partselect.com/PS423801-Frigidaire-215846602-Defrost-Timer-60hz-120v.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This Defrost Timer works like a clock by switching on the defrost heater circuit after a predetermined amount of compressor run time. This allows the defrost circuit to clear the evaporator of ice or frost to maintain proper airflow. The defrost timer is located in the control housing which is in the refrigerator section of your appliance. If this part is not working, it can lead to temperature increases in your refrigerator. If the compressor circuit fails, no cooling will take place; if the defrost circuit isn't activated, ice will quickly build up on the evaporator coils and reduce airflow and efficiency. If the timer doesn't advance or if the contacts have no continuity, the timer will need to be replaced. This timer measures approximately 3 inches long and 2.5 inches wide, and is constructed of plastic and metal. It comes in black/white/silver and is sold individually. This replacement part features 1 defrost timer."
  },
  {
    "id": "PS11770473-install",
    "part_number": "PS11770473",
    "title": "White Refrigerator Handle Set (2 Pieces) 5304506469",
    "url": "https://www.partselect.com/PS11770473-Frigidaire-5304506469-White-Refrigerator-Handle-Set-2-Pieces.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This Refrigerator Handle set comes in 2 pieces, and measures roughly 17\" in length. It can be installed with a screwdriver to allow the door to be opened and closed. If your handle is visibly broken then it should be replaced. Refer to your model number, and user manual to see if this part is right for you. These door handles are not sold individually, so we recommend replacing both handles at one time, or keeping the second one as a spare in case of future repairs. If you require the mounting blocks for the handle, these are sold separately. To make the repair, simply remove the screws at the top of the lower door, and replace the handle, screwing it into place."
  },
  {
    "id": "PS11770475-install",
    "part_number": "PS11770475",
    "title": "Black Refrigerator Door Handle Set (2 Pieces) 5304506471",
    "url": "https://www.partselect.com/PS11770475-Frigidaire-5304506471-Black-Refrigerator-Door-Handle-Set-2-Pieces.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a door handle set for your refrigerator. This door handle set includes two 17-inch-long black handles that slide on and screw into your refrigerator door. If your current refrigerator door handles for your fridge or freezer compartments are missing, damaged, unsightly, or unable to pull the door, they will need replacing. To replace a door handle, unthread the screw securing its top and slide it down to release, then slide the new handle on and secure its top. This set includes two OEM door handles, but does not include their securing screws, which are instead sold separately."
  },
  {
    "id": "PS427922-install",
    "part_number": "PS427922",
    "title": "Door Handle 218428101",
    "url": "https://www.partselect.com/PS427922-Frigidaire-218428101-Door-Handle.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This white handle can be used with both the freezer door and the fresh food door of many refrigerators. Note: As per the manufacturer, this handle includes the mounting block and screw for the top of the handle. If you need the screw for the bottom, it must be ordered separately. This is a simple repair that only requires a Phillips screwdriver. You will remove the 2 screws located on the top of the fridge door and slide the old handle out of place. Take your new handle and use your screwdriver to position back into place."
  },
  {
    "id": "PS3504321-install",
    "part_number": "PS3504321",
    "title": "Defrost Heater 242044008",
    "url": "https://www.partselect.com/PS3504321-Frigidaire-242044008-Defrost-Heater.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The defrost heater is in the evaporator section at the rear of the freezer. This heater melts frost off of the evaporator coils."
  },
  {
    "id": "PS303781-install",
    "part_number": "PS303781",
    "title": "Refrigerator Defrost Heater And Bracket Assembly WR51X10055",
    "url": "https://www.partselect.com/PS303781-GE-WR51X10055-Refrigerator-Defrost-Heater-And-Bracket-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The defrost heater keeps the cooling coils from frosting over. The heater will get hot and melt any ice or frost build up around the coils."
  },
  {
    "id": "PS2340319-install",
    "part_number": "PS2340319",
    "title": "Refrigerator Mullion Articulation Assembly WR17X12591",
    "url": "https://www.partselect.com/PS2340319-GE-WR17X12591-Refrigerator-Mullion-Articulation-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Also known as a mullion heater. This mullion rail is white in colour. The door mullion rail creates an airtight seal between the doors on a French door refrigerator."
  },
  {
    "id": "PS16729788-install",
    "part_number": "PS16729788",
    "title": "Door Shelf Bin WR71X38307",
    "url": "https://www.partselect.com/PS16729788-GE-WR71X38307-Door-Shelf-Bin.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door shelf bin is a genuine OEM replacement part designed for refrigerators. It is made of highly durable clear plastic, which allows users to easily view the contents of the bin. The bin is a storage compartment used to hold various items such as bottles, jars, and condiments. It provides a convenient way to store and organize food items for easy access. The bin is vulnerable to breakage, discoloration, and warping over time. The bin may also fail due to overloading or accidental impacts. Do not place any items in the bin if it is damaged as this may result in accidental spills and damage to the interior components of the refrigerator. No mounting hardware is needed for this repair."
  },
  {
    "id": "PS429668-install",
    "part_number": "PS429668",
    "title": "Door Shelf Retainer Bar End Cap (Right Side) 240311502",
    "url": "https://www.partselect.com/PS429668-Frigidaire-240311502-Door-Shelf-Retainer-Bar-End-Cap-Right-Side.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This replacement bar end cap can be used for a shelf in your freezer. The end cap is 4.25 inches long and 2.4 inches wide. You may need a flat blade screwdriver in order to pop out the existing end cap. Slide the new cap in place, making sure the locking tab is secure, and replace the bar."
  },
  {
    "id": "PS16662680-install",
    "part_number": "PS16662680",
    "title": "Door Bin Shelf MAN64890501",
    "url": "https://www.partselect.com/PS16662680-LG-MAN64890501-Door-Bin-Shelf.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door basket, also known as a door shelf or door bin, is compatible with LG refrigerators. It is an authentic manufacturer replacement part, sourced directly from LG. It is made of clear plastic and it hooks into place on the inside of the fridge door. The door basket is perfect for storing bottles and jars in an organized manner. Over time, it is common for the door basket to become discolored, warped, or cracked. It is recommended to replace it in order to continue storing your items safely. Each door basket is sold individually."
  },
  {
    "id": "PS17139673-install",
    "part_number": "PS17139673",
    "title": "MWF MANIFOLD WR02X45206",
    "url": "https://www.partselect.com/PS17139673-GE-WR02X45206-MWF-MANIFOLD.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The filter is NOT included with this part."
  },
  {
    "id": "PS16874486-install",
    "part_number": "PS16874486",
    "title": "SMALL CUBE ICEMAKER WR30X39345",
    "url": "https://www.partselect.com/PS16874486-GE-WR30X39345-SMALL-CUBE-ICEMAKER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This OEM small cube ice maker assembly fits select refrigerator models and includes the ice mold and control device. It automates the freezing and ejection of ice cubes, refilling with water until the storage bin is full. Unplug the refrigerator and store perishable food items safely before installation. Wear gloves to protect your hands, and verify compatibility with your model using the parts diagram."
  },
  {
    "id": "PS3536013-install",
    "part_number": "PS3536013",
    "title": "Refrigerator Plastic Tube MJU62070602",
    "url": "https://www.partselect.com/PS3536013-LG-MJU62070602-Refrigerator-Plastic-Tube.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This water tube, or plastic tube, is used in refrigerators and freezers. The tube ensures water is directed to parts of the refrigerator that need it, such as the water dispenser and ice maker. If you find that your current one is leaking or broken in any way, replacing the tube can fix this problem. Make sure to unplug the appliance from the power source before you start this installation project. Refer to the diagram provided by the manufacturer for further instruction and accurate guidance."
  },
  {
    "id": "PS12374439-install",
    "part_number": "PS12374439",
    "title": "Refrigerator Front Plate Assembly AGU75188619",
    "url": "https://www.partselect.com/PS12374439-LG-AGU75188619-Refrigerator-Front-Plate-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a replacement mullion rail for your French door-style refrigerator. You will typically find the mullion rail on the left side refrigerator door. The mullion rail helps to keep the refrigerator door closed. If the door will not close properly or if you notice leaking on your floor, you may need to replace the door mullion. A faulty mullion can gather moisture, resulting in a leak. To replace the mullion, simply disconnect the old mullion from the wire harness and unscrew it. Re-attach the wire harness to the mullion and screw it back into place."
  },
  {
    "id": "PS16619589-install",
    "part_number": "PS16619589",
    "title": "DOOR DAIRY WR71X38317",
    "url": "https://www.partselect.com/PS16619589-GE-WR71X38317-DOOR-DAIRY.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is the replacement dairy door for a refrigerator. It is installed on the inner door and rotates up and down to allow access to the dairy compartment. It is made of clear plastic. If your dairy door is cracked, broken, missing, or won't stay on, you may need to replace it. This is an OEM part sourced directly from the manufacturer."
  },
  {
    "id": "PS1525960-install",
    "part_number": "PS1525960",
    "title": "Dairy Door (Clear) 240337712",
    "url": "https://www.partselect.com/PS1525960-Frigidaire-240337712-Dairy-Door-Clear.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a dairy door for your refrigerator. This part covers the products in the dairy bin section. To access this section, simply lift the lid. This dairy door is made entirely of plastic and is transparent. It is almost 10 inches wide, and roughly 6 inches long. In order to make this repair you will not need any tools, as this part will easily clip in and out of place of the hinged holes."
  },
  {
    "id": "PS12071116-install",
    "part_number": "PS12071116",
    "title": "Refrigerator Roller 5304508016",
    "url": "https://www.partselect.com/PS12071116-Frigidaire-5304508016-Refrigerator-Roller.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This crisper pan roller is sourced directly from the manufacturer for use in your refrigerator. It is a genuine OEM part that is designed to fit just like the original for your convenience. The roller is a plastic wheel-like component that attached to the sides of the crisper pan and allows it slide in and out of the refrigerator smoothly. The rollers allow users to easily and conveniently access the contents of the drawers. Over time, the roller may wear down, break, or fall off. If the roller is faulty, you may notice difficulty sliding the drawer in and out, or the drawer may feel loose and unstable when you pull it out. Each crisper pan roller is sold individually. Ensure that you order the correct number of rollers for your refrigerator."
  },
  {
    "id": "PS11745525-install",
    "part_number": "PS11745525",
    "title": "Dishwasher Upper Rack Wheel & Mount Assembly WP8270019",
    "url": "https://www.partselect.com/PS11745525-Whirlpool-WP8270019-Dishwasher-Upper-Rack-Wheel-Mount-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Sold Individually."
  },
  {
    "id": "PS3532772-install",
    "part_number": "PS3532772",
    "title": "Roller Assembly AHJ72909001",
    "url": "https://www.partselect.com/PS3532772-LG-AHJ72909001-Roller-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a drawer roller for the freezer compartment of your LG refrigerator. This roller is made of white plastic, and acts as a wheel to allow the drawer to glide smoothly back and forth when you open and close the freezer compartment. Over time and with further frequent use, this roller can crack, break, or stop rolling smoothly, at which point it will need replacing. Your refrigerator comes with two rollers, and this roller is sold individually, so consider how many rollers you require before ordering."
  },
  {
    "id": "PS11750123-install",
    "part_number": "PS11750123",
    "title": "Refrigerator Compressor Start Relay WPW10197428",
    "url": "https://www.partselect.com/PS11750123-Whirlpool-WPW10197428-Refrigerator-Compressor-Start-Relay.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This compressor start relay is for refrigerators. The compressor start relay attaches to the compressor and helps start the compressor motor. Safely store any food that could deteriorate while the power is off and unplug the refrigerator before installing this part."
  },
  {
    "id": "PS8746522-install",
    "part_number": "PS8746522",
    "title": "Refrigerator Compressor Start Device And Capacitor W10613606",
    "url": "https://www.partselect.com/PS8746522-Whirlpool-W10613606-Refrigerator-Compressor-Start-Device-And-Capacitor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This includes both the run capacitor and the start relay. The capacitor helps the compressor kick on and off while maintaining a constant temperature to keep things frozen in your freezer. The start relay boosts the compressor, and then shuts off as soon as the motor gets up to speed and the overload provides extra protection against excessive temperatures."
  },
  {
    "id": "PS3502347-install",
    "part_number": "PS3502347",
    "title": "Compressor Start Relay 297237702",
    "url": "https://www.partselect.com/PS3502347-Frigidaire-297237702-Compressor-Start-Relay.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The start relay briefly boosts the compressor, and then shuts off as soon as the motor gets up to speed. Note: This part has been updated by the manufacturer. It may differ in appearance but will still function the same as the original."
  },
  {
    "id": "PS1018129-install",
    "part_number": "PS1018129",
    "title": "Refrigerator Evaporator Fan Blade WR60X10204",
    "url": "https://www.partselect.com/PS1018129-GE-WR60X10204-Refrigerator-Evaporator-Fan-Blade.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This blade attaches to the evaporator motor."
  },
  {
    "id": "PS11703633-install",
    "part_number": "PS11703633",
    "title": "Condenser Fan Blade 241639502",
    "url": "https://www.partselect.com/PS11703633-Frigidaire-241639502-Condenser-Fan-Blade.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a genuine condenser fan blade, which works with refrigerators, freezers and wines and beverage coolers."
  },
  {
    "id": "PS473177-install",
    "part_number": "PS473177",
    "title": "Evaporator Fan Blade 5308000010",
    "url": "https://www.partselect.com/PS473177-Frigidaire-5308000010-Evaporator-Fan-Blade.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This evaporator fan blade is a genuine OEM part that is sourced directly from the manufacturer. The evaporator fan blade circulates air through the refrigerator to control the amount of cold air goes that goes to internal compartments of the unit. It may need to be replaced if the fridge is noisy or not cold enough. This part is made of plastic and is sold individually. It will be necessary to disconnect power to the refrigerator and empty the freezer compartment of the refrigerator. The tools needed to complete this repair are a 1/4 inch nut driver and a pair of needle nose pliers."
  },
  {
    "id": "PS964304-install",
    "part_number": "PS964304",
    "title": "Refrigerator Dispenser Door Assembly Or Flapper WR17X11653",
    "url": "https://www.partselect.com/PS964304-GE-WR17X11653-Refrigerator-Dispenser-Door-Assembly-Or-Flapper.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This “Dispenser Door Assembly” (Door Recess Assembly, Ice Door Assembly, Dispenser Door, Refrigerator Dispenser Ice Chute Door Kit, Dispenser Door Flap, Ice Chute Door, Flapper) keeps the room air from infiltrating the freezer. Once the lever is pressed, the door flap opens and allows the ice to dispense into your container. If your door flapper is broken, it could allow outside air to enter the freezer and alter the inside temperature. You may notice frost buildup surrounding the dispenser area. The door flap can disconnect from the dispenser lever, or the tabs that hold it in place may break. Frequent use may distort the sealing face and cause air leaks and frost buildup. This part mounts in the ice dispenser, and measures approximately 3.25 inches in diameter. It is constructed of plastic and rubber, and comes in white/black. This part is sold individually."
  },
  {
    "id": "PS1526418-install",
    "part_number": "PS1526418",
    "title": "Water Dispenser Actuator 241685703",
    "url": "https://www.partselect.com/PS1526418-Frigidaire-241685703-Water-Dispenser-Actuator.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Once a glass is pressed against the actuator pad it will cause the dispenser to deliver ice or water when activated."
  },
  {
    "id": "PS12071009-install",
    "part_number": "PS12071009",
    "title": "Dispenser Control Module 242270106",
    "url": "https://www.partselect.com/PS12071009-Frigidaire-242270106-Dispenser-Control-Module.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "A dispenser control module is an electronic component that controls the dispensing functions within a refrigerator's door or panel. It releases filtered water, ice, and crushed ice on demand."
  },
  {
    "id": "PS304103-install",
    "part_number": "PS304103",
    "title": "Refrigerator Temperature Sensor WR55X10025",
    "url": "https://www.partselect.com/PS304103-GE-WR55X10025-Refrigerator-Temperature-Sensor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This sensor (Temperature Sensor, Thermistor, Refrigerator Temperature Sensor) sends the temperature reading of the compartment to the control board. If you notice your refrigerator is too warm, too cold, or not defrosting properly, then there may be a problem with your sensor. The temperature sensor can break from material fatigue or through normal use, and should be replaced. It is attached to the evaporator and control housing in your appliance. It measures approximately 1.25 inches long with 18 inch wire leads, and is constructed out of plastic. This part comes in white, beige. It includes the sensor, with wire leads."
  },
  {
    "id": "PS11755842-install",
    "part_number": "PS11755842",
    "title": "Ice Maker Bin Temperature Sensor WPW10511923",
    "url": "https://www.partselect.com/PS11755842-Whirlpool-WPW10511923-Ice-Maker-Bin-Temperature-Sensor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This bin temperature sensor is for ice makers. The bin temperature sensor monitors the temperature in the ice maker bin and sends the temperature reading to the electronic control board. Disconnect the power before installing this part. Wear work gloves to protect your hands."
  },
  {
    "id": "PS11741429-install",
    "part_number": "PS11741429",
    "title": "Dryer Radiant Flame Sensor WP338906",
    "url": "https://www.partselect.com/PS11741429-Whirlpool-WP338906-Dryer-Radiant-Flame-Sensor.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "If your gas dryer is not heating up or igniting, then replacing the flame sensor, located in the burner assembly, could solve it. This part senses heat from the igniter to monitor if it is hot enough to ignite gas to light the burner. Once the igniter is hot enough it will open the valve and allow gas to flow. This is a safety mechanism to prevent dangerous levels of gas from building up. To repair, the main top of the dryer should be lifted, as well as the front panel to access the component. This flame sensor assembly is made of both plastic and metal."
  },
  {
    "id": "PS12585793-install",
    "part_number": "PS12585793",
    "title": "DEFROST TIMER 5304518034",
    "url": "https://www.partselect.com/PS12585793-Frigidaire-5304518034-DEFROST-TIMER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a 120 volt defrost timer manufactured for refrigerators. The defrost timer manages the automatic defrost systemin the unit. It acts like a clock by switching between activating the cooling cycle and the defrost heater to maintain the set thermostat temperature, preventing the unit from being too warm or cold. The defrost timer may need to be replaced if the fridge will not maintain its temperature or has frost buildup. Depending on the model, it could be located on the rear panel or ceiling of the fresh food compartment. Be sure to disconnect power to the refrigerator before replacing this part."
  },
  {
    "id": "PS423801-install",
    "part_number": "PS423801",
    "title": "Defrost Timer (60hz 120v) 215846602",
    "url": "https://www.partselect.com/PS423801-Frigidaire-215846602-Defrost-Timer-60hz-120v.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This Defrost Timer works like a clock by switching on the defrost heater circuit after a predetermined amount of compressor run time. This allows the defrost circuit to clear the evaporator of ice or frost to maintain proper airflow. The defrost timer is located in the control housing which is in the refrigerator section of your appliance. If this part is not working, it can lead to temperature increases in your refrigerator. If the compressor circuit fails, no cooling will take place; if the defrost circuit isn't activated, ice will quickly build up on the evaporator coils and reduce airflow and efficiency. If the timer doesn't advance or if the contacts have no continuity, the timer will need to be replaced. This timer measures approximately 3 inches long and 2.5 inches wide, and is constructed of plastic and metal. It comes in black/white/silver and is sold individually. This replacement part features 1 defrost timer."
  },
  {
    "id": "PS11723171-install",
    "part_number": "PS11723171",
    "title": "Refrigerator Defrost Timer W10822278",
    "url": "https://www.partselect.com/PS11723171-Whirlpool-W10822278-Refrigerator-Defrost-Timer.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The Defrost Timer (Defrost control) acts like a clock by switching on the defrost heater circuit after a predetermined amount of compressor run time. This allows the defrost circuit to clear the evaporator of ice or frost to maintain proper airflow. If this part is not working, it can lead to temperature increases in your refrigerator. If the compressor circuit fails, no cooling will take place; if the defrost circuit isn't activated, ice will quickly build up on the evaporator coils and reduce airflow and efficiency. If the timer doesn't advance or if the contacts have no continuity, the timer will need to be replaced. This part is located inside of the control housing on most models, and is approximately 3 inches long and 2.5 inches wide. This part is constructed of plastic and metal, and comes in white. It features 1 defrost timer, along with all necessary mounting hardware and installation instructions"
  },
  {
    "id": "PS11739027-install",
    "part_number": "PS11739027",
    "title": "Refrigerator Control Bracket WP2180226",
    "url": "https://www.partselect.com/PS11739027-Whirlpool-WP2180226-Refrigerator-Control-Bracket.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a control bracket for your refrigerator, and may also be known as the dispenser control bracket. The function of this part is to hold the micro switches and the light socket in the freezer dispenser section in place. Its measurements are roughly 9 inches long and 5 inches high, and this model comes in white. The tools you will need in order to do this repair include a Phillips screw driver, a quarter-inch nut-driver, and a pair of needle-nose pliers. If your ice dispenser is not working properly, your bracket could be the problem."
  },
  {
    "id": "PS11754209-install",
    "part_number": "PS11754209",
    "title": "Bracket WPW10397055",
    "url": "https://www.partselect.com/PS11754209-Whirlpool-WPW10397055-Bracket.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing our genuine Whirlpool Door Stop Bracket, an essential component designed to protect your refrigerator and surrounding cabinets from potential damage by controlling the swing of the door. It functions with a wide range of Whirlpool models and has been crafted to overarching standards set by the original equipment manufacturer. With this Whirlpool Door Stop Bracket, you will find an ease in maintaining your refrigerator?s lifespan. It's important to verify your model before ordering, as despite some parts appearing similar, there may be slight variations in size and shape. Don't forget, during the repair process, ensure to securely store food items that could spoil with the door open. This Door Stop Bracket exemplifies durability and plays a key role in lengthening the longevity of your appliance."
  },
  {
    "id": "PS3535435-install",
    "part_number": "PS3535435",
    "title": "Refrigerator Door Holder MEG61899901",
    "url": "https://www.partselect.com/PS3535435-LG-MEG61899901-Refrigerator-Door-Holder.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a manufacturer-approved refrigerator door closure for your refrigerator. It is made of white plastic and measures approximately 3 inches by 2 inches. If your old closure is damaged, your refrigerator door may not open and shut properly, and therefore it should be replaced."
  },
  {
    "id": "PS11756053-install",
    "part_number": "PS11756053",
    "title": "Refrigerator Kickplate Grille (Apollo Gray) WPW10534155",
    "url": "https://www.partselect.com/PS11756053-Whirlpool-WPW10534155-Refrigerator-Kickplate-Grille-Apollo-Gray.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This kickplate grille is attached to the bottom of the refrigerator."
  },
  {
    "id": "PS2340503-install",
    "part_number": "PS2340503",
    "title": "Kickplate Grille WR74X10270",
    "url": "https://www.partselect.com/PS2340503-GE-WR74X10270-Kickplate-Grille.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Clips sold separately."
  },
  {
    "id": "PS11756051-install",
    "part_number": "PS11756051",
    "title": "Refrigerator Kickplate Grille (Black) WPW10534153",
    "url": "https://www.partselect.com/PS11756051-Whirlpool-WPW10534153-Refrigerator-Kickplate-Grille-Black.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This kickplate grille is attached to the bottom of the refrigerator."
  },
  {
    "id": "PS4163672-install",
    "part_number": "PS4163672",
    "title": "Refrigerator French Door Spring DA81-01345B",
    "url": "https://www.partselect.com/PS4163672-Samsung-DA81-01345B-Refrigerator-French-Door-Spring.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The French door divider spring fits most Samsung French door style refrigerators. The spring applies tension between components in the refrigerator, which engages and retracts the door flap. This will allow the door to close properly. If the spring is broken, damaged, or faulty the door flap will swing open and block the door from closing, and you should look to replace the part straight away to prevent further damage to the door. The spring is a genuine OEM part, is made of metal, and measures at 1 1/2\" long. This part is also known as a refrigerator door mullion spring."
  },
  {
    "id": "PS4163673-install",
    "part_number": "PS4163673",
    "title": "Spring Pin DA81-01346A",
    "url": "https://www.partselect.com/PS4163673-Samsung-DA81-01346A-Spring-Pin.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This pin acts as a sleeve for the French door spring in a refrigerator. This is a genuine OEM part that is sold individually and works with the spring within the door mullion to seal the door shut. If you need to replace the sleeve, check whether the spring in the door is still intact as well. You will only need to replace one spring sleeve pin per door, as there is only one sleeve on the upper part of the spring. To remove the spring and replace the mullion, do so with a set of needle-nose pliers and lift the lower side of the spring to easily pull it out, then you can replace the sleeve.?"
  },
  {
    "id": "PS285013-install",
    "part_number": "PS285013",
    "title": "Refrigerator Recess Door Spring WR02X10585",
    "url": "https://www.partselect.com/PS285013-GE-WR02X10585-Refrigerator-Recess-Door-Spring.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This door recess spring or dispenser lever spring in your refrigerator is used to return the ice door to the closed position or the dispenser lever to the home position once released. You will find the spring in the water dispenser assembly, behind the main control panel. If the dispenser lever is malfunctioning or the dispenser ice door is not closing, you may need to replace this door recess spring."
  },
  {
    "id": "PS12731471-install",
    "part_number": "PS12731471",
    "title": "Refrigerator Bearing 5304522194",
    "url": "https://www.partselect.com/PS12731471-Frigidaire-5304522194-Refrigerator-Bearing.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12741835-install",
    "part_number": "PS12741835",
    "title": "Refrigerator Bearing 5304522193",
    "url": "https://www.partselect.com/PS12741835-Frigidaire-5304522193-Refrigerator-Bearing.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12731414-install",
    "part_number": "PS12731414",
    "title": "Refrigerator Bearing 5304519757",
    "url": "https://www.partselect.com/PS12731414-Frigidaire-5304519757-Refrigerator-Bearing.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS17629372-install",
    "part_number": "PS17629372",
    "title": "Bucket/Trim Assembly W11706640",
    "url": "https://www.partselect.com/PS17629372-Whirlpool-W11706640-Bucket-Trim-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is a replacement door bin for your refrigerator. It is made of white plastic and is approximately 13 inches wide at its longest point and is 8 inches deep and 4 inches tall. The door bin holds items that are stored in the door in place. You will want to replace the door bin if the old one is cracked, damaged, or missing. To replace the door bin, simply snap the old bin out and snap the new one into place. This bin is sold individually and is an OEM part sourced directly from the manufacturer."
  },
  {
    "id": "PS430138-install",
    "part_number": "PS430138",
    "title": "Shelf Front Trim (White) 240357703",
    "url": "https://www.partselect.com/PS430138-Frigidaire-240357703-Shelf-Front-Trim-White.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12114490-install",
    "part_number": "PS12114490",
    "title": "Door Trim W11129820",
    "url": "https://www.partselect.com/PS12114490-Whirlpool-W11129820-Door-Trim.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This Whirlpool TRIM-DOOR Door shelf bar is an authentic OEM part ideal for those seeking a reliable and durable replacement piece. Perfectly crafted to fit certain Whirlpool models, its size and shape may slightly vary hence, careful selection before purchase is vital to ensure it matches your appliance. Installation is quick and seamless as the Door shelf bar conveniently snaps into place to hold your items securely on the refrigerator's door shelf. In order to facilitate correct fitting, please refer to the instructions provided in your owner's manual upon installation. Upgrade your Whirlpool refrigerator with this quality TRIM-DOOR shelf bar and keep your items organized. Please remember this is a genuine part from Whirlpool, ensuring optimal quality and performance."
  },
  {
    "id": "PS8758075-install",
    "part_number": "PS8758075",
    "title": "LATCH ICEBOX DOOR WR11X10031",
    "url": "https://www.partselect.com/PS8758075-GE-WR11X10031-LATCH-ICEBOX-DOOR.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Improve the functionality of your refrigerator with this robust, GE Latch Icebox Door. Specifically designed for GE refrigerators, this essential component ensures secure closure and efficient performance of your ice room door. Remember, before beginning the installation process, to unplug your refrigerator and store any perishable food items safely. It is also advisable to wear protective work gloves during the repair to safeguard your hands. Rely on GE's commitment to quality and restore your refrigerator's optimal performance with this durable icebox door latch."
  },
  {
    "id": "PS11729547-install",
    "part_number": "PS11729547",
    "title": "COVER LATCH WR02X23032",
    "url": "https://www.partselect.com/PS11729547-GE-WR02X23032-COVER-LATCH.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the GE Ice Bank Door Latch Cover, a vital component that sets the benchmark for refrigerator maintenance. This component is designed to attach seamlessly over your existing ice bank door latch, ensuring secure and efficient operation of your refrigerator's ice making function. Essential for those who prioritize the longevity and performance of their appliances, this cover latch provides additional protection for your ice bank door latch. It's advisable to wear work gloves during the installation process for your safety. Choose GE for high-quality and durable refrigerator parts."
  },
  {
    "id": "PS16875810-install",
    "part_number": "PS16875810",
    "title": "Bin Latch W11652042",
    "url": "https://www.partselect.com/PS16875810-Whirlpool-W11652042-Bin-Latch.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS8748092-install",
    "part_number": "PS8748092",
    "title": "Refrigerator Water Dispenser Button ABH74219603",
    "url": "https://www.partselect.com/PS8748092-LG-ABH74219603-Refrigerator-Water-Dispenser-Button.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This water dispenser button is a genuine OEM part designed for LG refrigerators. When you push the button, a valve is activated inside the refrigerator, which releases water from the internal water supply. If the button is faulty, you will also likely notice that the dispenser can not release any water, or that it does so inconsistently. Over time the button may fail due to aging or due to accidental damage. You will need to replace the button if it is unresponsive when you push it, or if it seems stuck."
  },
  {
    "id": "PS12743834-install",
    "part_number": "PS12743834",
    "title": "CONTROL KNOB WR02X31466",
    "url": "https://www.partselect.com/PS12743834-GE-WR02X31466-CONTROL-KNOB.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11739853-install",
    "part_number": "PS11739853",
    "title": "Ice Bin Button WP2252265",
    "url": "https://www.partselect.com/PS11739853-Whirlpool-WP2252265-Ice-Bin-Button.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Blue in color."
  },
  {
    "id": "PS11750972-install",
    "part_number": "PS11750972",
    "title": "Range Terminal Block WPW10245259",
    "url": "https://www.partselect.com/PS11750972-Whirlpool-WPW10245259-Range-Terminal-Block.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part is for oven ranges, it connects individual wires and protects the device from electrical surges, voltages, and current. With this part, the house power is connected to the range wire harness. Some symptoms replacing the terminal block could be a solution for are little to no heat when baking, element will not heat and/or it will not start. This part will prevent loosening and will reduce damage caused by corrosion (by two different metals). Refer to the instructional diagram for further replacement guidance and exact placement. You must unplug the appliance before installing this part and wear gloves to protect your hands."
  },
  {
    "id": "PS12584385-install",
    "part_number": "PS12584385",
    "title": "Wire Harness W11260592",
    "url": "https://www.partselect.com/PS12584385-Whirlpool-W11260592-Wire-Harness.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This freezer wire harness with defrost thermostat is a genuine Whirlpool replacement part designed to help keep your refrigerator running smoothly and efficiently. It works to supply power to the critical electrical components within your fridge. Please take care to verify that this part is correct for your model before ordering, as slight variations in size and shape can occur. Prior to installation, be sure to unplug the refrigerator for safety and wear work gloves to protect your hands. It is also advised to temporarily store perishable food items elsewhere to avoid spoilage. Trust in Whirlpool to help keep your refrigerator in peak condition."
  },
  {
    "id": "PS11770341-install",
    "part_number": "PS11770341",
    "title": "Wire Harness W11033168",
    "url": "https://www.partselect.com/PS11770341-Whirlpool-W11033168-Wire-Harness.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS783769-install",
    "part_number": "PS783769",
    "title": "Refrigerator Water Tank Assembly WR17X11440",
    "url": "https://www.partselect.com/PS783769-GE-WR17X11440-Refrigerator-Water-Tank-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This tank stores water until the water actuator is activated and water is requested."
  },
  {
    "id": "PS11769752-install",
    "part_number": "PS11769752",
    "title": "Ice Dispenser Bucket W10910401",
    "url": "https://www.partselect.com/PS11769752-Whirlpool-W10910401-Ice-Dispenser-Bucket.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the genuine Ice Dispenser Bucket Assembly from the esteemed brand, Whirlpool. This authentic OEM part has been thoughtfully designed to work with select models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef appliances. Please ensure to verify your model number before ordering for the perfect fit as parts can differ subtly in size and shape. This Ice Dispenser Bucket Assembly is all set to optimize the functioning of your appliance. Ensure superior performance and prolong the life of your appliance with our trusted Whirlpool parts. Refresh your appliance with our high-quality Ice Dispenser Bucket Assembly."
  },
  {
    "id": "PS3618757-install",
    "part_number": "PS3618757",
    "title": "Water Reservoir AJL72911502",
    "url": "https://www.partselect.com/PS3618757-LG-AJL72911502-Water-Reservoir.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The water reservoir holds the water for the water dispenser as the water chills."
  },
  {
    "id": "PS3487846-install",
    "part_number": "PS3487846",
    "title": "Refrigerator Grill Recess WR17X12873",
    "url": "https://www.partselect.com/PS3487846-GE-WR17X12873-Refrigerator-Grill-Recess.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Indulge in a seamless and mess-free dispensing experience with the GE Dispenser Drip Tray designed especially for your refrigerator. This product acts as a reliable shield, capturing all the residual water drips during the dispenser's operation and maintaining a clean and dry dispenser area. It?s easy to install the new drip tray? simply pull out the former one from the dispenser housing and slide in the new one with utmost ease. For a safe installation, don't forget to wear work gloves. Plus, the item features an attractive GRILL RECESS design, adding to its overall appeal. Keep in mind, this GE dispenser drip tray guarantees durability, contributing to the longevity of your refrigerator."
  },
  {
    "id": "PS3487856-install",
    "part_number": "PS3487856",
    "title": "Refrigerator Recess WR17X12884",
    "url": "https://www.partselect.com/PS3487856-GE-WR17X12884-Refrigerator-Recess.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Upgrade your refrigerator with the GE Dispenser Drip Tray. This vital accessory catches the water that casually drips from the dispenser during use, ensuring your fridge stays clean and dry. To install, simply pull the existing tray from the dispenser housing and slide the new drip tray into place -- no fuss, no hassle. Remember, gloves are recommended to protect your hands during this quick process. This grill recess design provides a seamless and integrated look to your refrigerator. Invest in GE quality and make refrigerator maintenance easy and efficient."
  },
  {
    "id": "PS11756973-install",
    "part_number": "PS11756973",
    "title": "Drip Pan WPW10655367",
    "url": "https://www.partselect.com/PS11756973-Whirlpool-WPW10655367-Drip-Pan.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Boost the longevity of your refrigerator with this genuine Whirlpool drain pan. Designed to fit selected models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef refrigerators, this part ensures a neat and clean interior. The drain pan sits at the bottom of the cabinet, hidden behind the toe grille, and collects water that trickles out through the drain line during the defrost cycle. Please refer to your owner's manual for guidance during installation. Carefully verify compatibility with your model before purchasing, since parts may have subtle differences in size and shape. This drain pan will enhance your refrigerator's performance and is a quality investment for your kitchen."
  },
  {
    "id": "PS16544371-install",
    "part_number": "PS16544371",
    "title": "FOOT 5304528815",
    "url": "https://www.partselect.com/PS16544371-Frigidaire-5304528815-FOOT.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11748978-install",
    "part_number": "PS11748978",
    "title": "Foot Brake WPW10141622",
    "url": "https://www.partselect.com/PS11748978-Whirlpool-WPW10141622-Foot-Brake.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the Whirlpool Refrigerator Leveling Leg. This genuine OEM part supports your refrigerator, ensuring it remains stability and level. The height of the leveling leg can be adjusted to suit your unique refrigerator model, providing you with versatility and customization. This leveling leg is compatible with some models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef fridges. For a smooth installation, we recommend wearing work gloves to protect your hands. Verify your model compatibility before purchase."
  },
  {
    "id": "PS425733-install",
    "part_number": "PS425733",
    "title": "Adjustable Leveling Foot - Black 216396900",
    "url": "https://www.partselect.com/PS425733-Frigidaire-216396900-Adjustable-Leveling-Foot-Black.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part could be found underneath a fridge, dryer, or freezer. The original foot may be cracked, broken, or perhaps missing altogether. If you notice the appliance is uneven to the floor or wobbling, it may indicate that the levelling foot needs to be replaced. You will need pliers and a block of wood to perform this task. There will be one adjustable foot found in the package. Lift the dryer and place the wood to keep it propped up. You may need to use the pliers to remove the old foot. Screw the new foot into place using your hand. Once the new leveling foot is in place, lift the appliance and remove the block. Test the machine out to ensure it is now sitting level."
  },
  {
    "id": "PS7320365-install",
    "part_number": "PS7320365",
    "title": "Display Cover WR17X13155",
    "url": "https://www.partselect.com/PS7320365-GE-WR17X13155-Display-Cover.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This display cover is for refrigerators. Display cover supports the display control board and houses the touchpad for the display. Safely store any food that could deteriorate while the power is off. Unplug the refrigerator before installing this part. Wear work gloves to protect your hands."
  },
  {
    "id": "PS8762433-install",
    "part_number": "PS8762433",
    "title": "Twin Cooling Evaporator Cover DA97-13757A",
    "url": "https://www.partselect.com/PS8762433-Samsung-DA97-13757A-Twin-Cooling-Evaporator-Cover.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is the evaporator cover assembly for a wide range of Samsung refrigerators. This cover features the evaporator fan assembly and insulation behind it and is installed in the rear of the refrigerator cabinet. If your refrigerator is not cooling properly, or if the evaporator fan is broken and needs replacing, you need to replace it immediately to ensure optimal cooling performance in your fridge. This assembly is made of 25-inch-long white plastic and requires a drill or screwdriver to replace it. This assembly is sold individually and does not come with any other necessary parts or accessories, such as securing screws or brackets."
  },
  {
    "id": "PS11739126-install",
    "part_number": "PS11739126",
    "title": "Rear Compressor Cover WP2188755",
    "url": "https://www.partselect.com/PS11739126-Whirlpool-WP2188755-Rear-Compressor-Cover.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Used to cover up the compressor components."
  },
  {
    "id": "PS2003866-install",
    "part_number": "PS2003866",
    "title": "Drawer Gear Kit 12002497",
    "url": "https://www.partselect.com/PS2003866-Whirlpool-12002497-Drawer-Gear-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "These parts will attach to your drawer rail and are used to help the drawer glide smoothly."
  },
  {
    "id": "PS4156744-install",
    "part_number": "PS4156744",
    "title": "Refrigerator Freezer Drawer Slide Shaft DA66-00437B",
    "url": "https://www.partselect.com/PS4156744-Samsung-DA66-00437B-Refrigerator-Freezer-Drawer-Slide-Shaft.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The Freezer drawer slide shaft holds the gear to the rear slide rail at the back of the freezer drawer."
  },
  {
    "id": "PS8757898-install",
    "part_number": "PS8757898",
    "title": "Refrigerator Clutch Coupling Assembly WR02X13647",
    "url": "https://www.partselect.com/PS8757898-GE-WR02X13647-Refrigerator-Clutch-Coupling-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS2378335-install",
    "part_number": "PS2378335",
    "title": "Dishwasher Lower Dishrack Kit W10311986",
    "url": "https://www.partselect.com/PS2378335-Whirlpool-W10311986-Dishwasher-Lower-Dishrack-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The lower rack provides easy loading with flexibility for small and large items, and helps hold the dishes in place during the wash and dry cycle. The rack measures approximately 22-inch x 21-inch. The rack is light gray in color with wheels included, lower fold down, and a flexrow retainer. This is a genuine OEM part."
  },
  {
    "id": "PS12586006-install",
    "part_number": "PS12586006",
    "title": "RACK 5304518486",
    "url": "https://www.partselect.com/PS12586006-Frigidaire-5304518486-RACK.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the genuine RACK Door Bin from Frigidaire. Attach this high-quality door bin to the lower part of your refrigerator's interior door to create additional storage and ease of access to your items. Crafted from robust materials, this OEM part is specifically built for durability and longevity. Besides bottles and jars, this bin aims to assist in sorting a diverse range of smaller items too. To install, please refer to the specific instructions provided in the refrigerator's owner manual. Trust Frigidaire to elevate your refrigerator's functionality with this reliable door bin."
  },
  {
    "id": "PS971245-install",
    "part_number": "PS971245",
    "title": "2 Piece Broiler Pan 4396923",
    "url": "https://www.partselect.com/PS971245-Whirlpool-4396923-2-Piece-Broiler-Pan.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This is cookware designed for use in your range or oven. It is a two-piece dish that is used to grill or cook food while the broil function is on, meaning it can withstand high temperatures. This set includes both the pan and the grid. The grid is the top part. The slotted design allows grease to easily drip into to the pan below. Not only does it catch all of the drippings, it also prevents splatter and smoke while cooking. The pan can also be used separately for baking and roasting. This cookware features a durable porcelain finish, which means it is incredibly easy to clean, and is dishwasher safe. It is roughly 1.5 inches deep, and measures approximately 16.5 inches by 12.5 inches. If your two-piece broil plan is lost, rusted, or damaged this is the replacement you need."
  },
  {
    "id": "PS4140330-install",
    "part_number": "PS4140330",
    "title": "Thermal Fuse Assembly DA47-00095E",
    "url": "https://www.partselect.com/PS4140330-Samsung-DA47-00095E-Thermal-Fuse-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12719790-install",
    "part_number": "PS12719790",
    "title": "Fuse Block Module DA92-00945F",
    "url": "https://www.partselect.com/PS12719790-Samsung-DA92-00945F-Fuse-Block-Module.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS4140642-install",
    "part_number": "PS4140642",
    "title": "Defrost Thermal Fuse DA47-00301B",
    "url": "https://www.partselect.com/PS4140642-Samsung-DA47-00301B-Defrost-Thermal-Fuse.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This defrost thermal fuse is for refrigerators and protects the evaporator from overheating."
  },
  {
    "id": "PS11773268-install",
    "part_number": "PS11773268",
    "title": "Air Handler Housing 5303918784",
    "url": "https://www.partselect.com/PS11773268-Frigidaire-5303918784-Air-Handler-Housing.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS8688247-install",
    "part_number": "PS8688247",
    "title": "Refrigerator Duct Foam WR02X20092",
    "url": "https://www.partselect.com/PS8688247-GE-WR02X20092-Refrigerator-Duct-Foam.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The air duct insulation fits between the air duct and air duct cover, and prevents warmer air from entering the air duct."
  },
  {
    "id": "PS12579110-install",
    "part_number": "PS12579110",
    "title": "Freezer Air Duct Cover 242006903",
    "url": "https://www.partselect.com/PS12579110-Frigidaire-242006903-Freezer-Air-Duct-Cover.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12070612-install",
    "part_number": "PS12070612",
    "title": "Dishwasher Tub Sound Shield Insulation W11086533",
    "url": "https://www.partselect.com/PS12070612-Whirlpool-W11086533-Dishwasher-Tub-Sound-Shield-Insulation.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the Whirlpool Tub Sound Shield - an essential piece for maintaining the tranquility of your kitchen. Acting as an effective sound barrier, it significantly muffles the operating noise of your dishwasher, ensuring a quieter, more peaceful environment. This genuine Whirlpool OEM part is compatible with various models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef dishwashers. Please be advised, it is crucial to verify the compatibility of this part with your model before ordering, as small variations in size and shape may exist. Always remember to shut off your dishwasher or home circuit breaker before installation and wear suitable work gloves to protect your hands. Enjoy a more serene kitchen with the Whirlpool Tub Sound Shield!"
  },
  {
    "id": "PS1632252-install",
    "part_number": "PS1632252",
    "title": "Insulation 67003796",
    "url": "https://www.partselect.com/PS1632252-Whirlpool-67003796-Insulation.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Fiber Acoustic."
  },
  {
    "id": "PS1526428-install",
    "part_number": "PS1526428",
    "title": "Door Insulation 241688601",
    "url": "https://www.partselect.com/PS1526428-Frigidaire-241688601-Door-Insulation.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS2363831-install",
    "part_number": "PS2363831",
    "title": "Kickplate Grille (Stainless) 241969405",
    "url": "https://www.partselect.com/PS2363831-Frigidaire-241969405-Kickplate-Grille-Stainless.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS1525950-install",
    "part_number": "PS1525950",
    "title": "Kickplate Grille (White) 240324409",
    "url": "https://www.partselect.com/PS1525950-Frigidaire-240324409-Kickplate-Grille-White.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part attaches to the bottom of the refrigerator."
  },
  {
    "id": "PS2340504-install",
    "part_number": "PS2340504",
    "title": "Kickplate Grille - White WR74X10271",
    "url": "https://www.partselect.com/PS2340504-GE-WR74X10271-Kickplate-Grille-White.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This part attaches to the bottom of the refrigerator. Clips sold individually."
  },
  {
    "id": "PS358548-install",
    "part_number": "PS358548",
    "title": "Dishwasher Power Cord Kit 4317824",
    "url": "https://www.partselect.com/PS358548-Whirlpool-4317824-Dishwasher-Power-Cord-Kit.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Includes power cord and all necessary parts needed for complete installation of cord."
  },
  {
    "id": "PS16227180-install",
    "part_number": "PS16227180",
    "title": "Power Cord 241516904",
    "url": "https://www.partselect.com/PS16227180-Frigidaire-241516904-Power-Cord.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11743694-install",
    "part_number": "PS11743694",
    "title": "Power Cord WP67006506",
    "url": "https://www.partselect.com/PS11743694-Whirlpool-WP67006506-Power-Cord.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS16660578-install",
    "part_number": "PS16660578",
    "title": "CHUTE W11573761",
    "url": "https://www.partselect.com/PS16660578-Whirlpool-W11573761-CHUTE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Make your refrigerator operate like new with this genuine OEM CHUTE Mounting bracket & ice chute. Specifically compatible with select models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef. This authentic OEM part ensures your auger motor remains firmly in place, enhancing the longevity and function of your refrigerator's ice dispensing system. While the parts may appear similar, subtle differences in size and shape exist so confirm model compatibility prior to ordering. Always remember to put on work gloves as a safety measure during installation. Trust the Whirlpool brand for impeccable quality in all your appliance repair solutions."
  },
  {
    "id": "PS11738680-install",
    "part_number": "PS11738680",
    "title": "Chute WP13005705",
    "url": "https://www.partselect.com/PS11738680-Whirlpool-WP13005705-Chute.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Discover the Whirlpool Chute Dispenser Funnel & Frame Assembly, an essential for your refrigerator repair needs. Expertly crafted, this genuine OEM part is compatible with select Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef refrigerator models. The dispenser chute serves an important function - it opens to allow ice to pass through when dispensing it into a glass or container. Keep in mind, this assembly may include multiple parts. Prior to installing this part, ensure your refrigerator is unplugged and any food is stored safely. Plus, you're advised to wear work gloves to protect your hands during the process."
  },
  {
    "id": "PS11738681-install",
    "part_number": "PS11738681",
    "title": "Dispenser Funnel Chute - Grey WP13005706",
    "url": "https://www.partselect.com/PS11738681-Whirlpool-WP13005706-Dispenser-Funnel-Chute-Grey.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS16620630-install",
    "part_number": "PS16620630",
    "title": "STARTER 5304529507",
    "url": "https://www.partselect.com/PS16620630-Frigidaire-5304529507-STARTER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS16555735-install",
    "part_number": "PS16555735",
    "title": "STARTER 5304529285",
    "url": "https://www.partselect.com/PS16555735-Frigidaire-5304529285-STARTER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12731487-install",
    "part_number": "PS12731487",
    "title": "STARTER 5304522269",
    "url": "https://www.partselect.com/PS12731487-Frigidaire-5304522269-STARTER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12728804-install",
    "part_number": "PS12728804",
    "title": "Crusher Blade (#3) 241684109",
    "url": "https://www.partselect.com/PS12728804-Frigidaire-241684109-Crusher-Blade-3.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12728806-install",
    "part_number": "PS12728806",
    "title": "Refrigerator Ice Crusher Fixed Blade 241684303",
    "url": "https://www.partselect.com/PS12728806-Frigidaire-241684303-Refrigerator-Ice-Crusher-Fixed-Blade.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The ice crusher blade grinds the ice cubes in the ice container to create crushed ice."
  },
  {
    "id": "PS12731381-install",
    "part_number": "PS12731381",
    "title": "BLADE 241684107",
    "url": "https://www.partselect.com/PS12731381-Frigidaire-241684107-BLADE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS6447742-install",
    "part_number": "PS6447742",
    "title": "BADGE GE Assembly WR04X10181",
    "url": "https://www.partselect.com/PS6447742-GE-WR04X10181-BADGE-GE-Assembly.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12348533-install",
    "part_number": "PS12348533",
    "title": "Plate W11178521",
    "url": "https://www.partselect.com/PS12348533-Whirlpool-W11178521-Plate.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Introducing the Whirlpool NAMEPLATE, a genuine OEM part tailored to work with various Whirlpool models. Specifically designed for ranges, this nameplate prominently displays the prestigious Whirlpool brand name, reaffirming the quality and reliability of your appliance. Please ensure your model's compatibility with the NAMEPLATE before purchasing. As some parts may appear identical, be aware that there can be minor variations in size and shape. Enjoy enhancing your appliance with this finely-crafted part. Trust Whirlpool for all your appliances needs."
  },
  {
    "id": "PS11769728-install",
    "part_number": "PS11769728",
    "title": "Plate W10909682",
    "url": "https://www.partselect.com/PS11769728-Whirlpool-W10909682-Plate.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "This genuine Whirlpool NAMEPLATE is ideally designed for specific Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef models, reflecting the reliability and uncompromising quality of Whirlpool. The critical role of this NAMEPLATE is to showcase the brand name on the appliance, enhancing its aesthetic appeal. Although many parts might appear similar, subtle differences in size and shape often exist, hence the necessity to cross-check the correctness of your model before placing an order. Utilize the W10909682 NAMEPLATE to restore the original look of your appliance and uphold its brand value. With this high-grade NAMEPLATE, your appliance will maintain the brand aesthetic and serve you with the expected Whirlpool durability. Embrace this vital Whirlpool component for a swift, hassle-free, and dependable solution to your appliance nameplate needs."
  },
  {
    "id": "PS1817576-install",
    "part_number": "PS1817576",
    "title": "Cleaning Brush 4210463RW",
    "url": "https://www.partselect.com/PS1817576-Whirlpool-4210463RW-Cleaning-Brush.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Cleaning brush for coils on refrigerator and freezers, dryer lint filter housings, and more."
  },
  {
    "id": "PS11711207-install",
    "part_number": "PS11711207",
    "title": "BUSH MBF62704701",
    "url": "https://www.partselect.com/PS11711207-LG-MBF62704701-BUSH.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11711206-install",
    "part_number": "PS11711206",
    "title": "BUSH MBF62424301",
    "url": "https://www.partselect.com/PS11711206-LG-MBF62424301-BUSH.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11733706-install",
    "part_number": "PS11733706",
    "title": "Assembly ACCESSORY;BK,PAIR M DA99-04206A",
    "url": "https://www.partselect.com/PS11733706-Samsung-DA99-04206A-Assembly-ACCESSORY-BK-PAIR-M.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12707652-install",
    "part_number": "PS12707652",
    "title": "ASSY INSTALL-ACCESSORY;VALVE DA99-03490S",
    "url": "https://www.partselect.com/PS12707652-Samsung-DA99-03490S-ASSY-INSTALL-ACCESSORY-VALVE.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11758669-install",
    "part_number": "PS11758669",
    "title": "Assembly INSTALL-ACCESSORY;I DA99-03490T",
    "url": "https://www.partselect.com/PS11758669-Samsung-DA99-03490T-Assembly-INSTALL-ACCESSORY-I.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12113353-install",
    "part_number": "PS12113353",
    "title": "LED TRANSFORMER WR62X26946",
    "url": "https://www.partselect.com/PS12113353-GE-WR62X26946-LED-TRANSFORMER.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11755510-install",
    "part_number": "PS11755510",
    "title": "Transformer WPW10485951",
    "url": "https://www.partselect.com/PS11755510-Whirlpool-WPW10485951-Transformer.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Enhance the efficiency of your ice maker with this genuine OEM Whirlpool Transformer. Specifically designed for ice grid systems, this is a low voltage transformer which supplies power to your ice maker's pump and display panel lights. Prior to installing this part, remember to unplug your ice maker for your safety. As an authentic Whirlpool product, it ensures reliability and is perfect for specific models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef. Don't forget to cross-check your model number before purchasing, as parts may appear the same but have slight differences in size and shape. Enjoy the durability and performance that comes with this exclusive Whirlpool Transformer."
  },
  {
    "id": "PS11738264-install",
    "part_number": "PS11738264",
    "title": "Refrigerator Transformer WP11001154",
    "url": "https://www.partselect.com/PS11738264-Whirlpool-WP11001154-Refrigerator-Transformer.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "The transformer is for a personal beverage vending machine."
  },
  {
    "id": "PS16218398-install",
    "part_number": "PS16218398",
    "title": "GEAR 5304524001",
    "url": "https://www.partselect.com/PS16218398-Frigidaire-5304524001-GEAR.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS3407395-install",
    "part_number": "PS3407395",
    "title": "GEAR W10277360",
    "url": "https://www.partselect.com/PS3407395-Whirlpool-W10277360-GEAR.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS11711803-install",
    "part_number": "PS11711803",
    "title": "GEAR MDT62648401",
    "url": "https://www.partselect.com/PS11711803-LG-MDT62648401-GEAR.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS4176687-install",
    "part_number": "PS4176687",
    "title": "Table Top DA97-12706C",
    "url": "https://www.partselect.com/PS4176687-Samsung-DA97-12706C-Table-Top.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS8730573-install",
    "part_number": "PS8730573",
    "title": "WORKTOP 00646943",
    "url": "https://www.partselect.com/PS8730573-Bosch-00646943-WORKTOP.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12083250-install",
    "part_number": "PS12083250",
    "title": "Assembly TOP TABLE;RF9500M HUB 2.0,INOX GRAY DA97-12527X",
    "url": "https://www.partselect.com/PS12083250-Samsung-DA97-12527X-Assembly-TOP-TABLE-RF9500M-HUB-2-0-INOX-GRAY.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS298447-install",
    "part_number": "PS298447",
    "title": "Solenoid Saddle WR2X7309",
    "url": "https://www.partselect.com/PS298447-GE-WR2X7309-Solenoid-Saddle.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS12232042-install",
    "part_number": "PS12232042",
    "title": "Diaphragm W10804411",
    "url": "https://www.partselect.com/PS12232042-Whirlpool-W10804411-Diaphragm.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  },
  {
    "id": "PS9504251-install",
    "part_number": "PS9504251",
    "title": "R-CARBON;4.7OHM,5%,1/4W, 2001-000017",
    "url": "https://www.partselect.com/PS9504251-Samsung-2001-000017-R-CARBON-4-7OHM-5-1-4W.htm?SourceCode=18",
    "difficulty": "",
    "time_required": "",
    "tools": [],
    "text": "Hello!"
  }
]