{
  "PS11752778": {
    "part_number": "PS11752778",
    "title": "Upper Rack Adjuster Kit W10712395",
    "installation_text": "Installation is tool-free—simply align and snap into place. Verify your refrigerator's model number before ordering to ensure compatibility, as dimensions may vary slightly. Restore your refrigerator's storage capacity and organization with this high-quality replacement door bin.",
    "url": "https://www.partselect.com/PS11752778-Whirlpool-W10712395-Upper-Rack-Adjuster-Kit.htm?SourceCode=18",
    "id": "PS11752778-install"
  },
  "PS11752991": {
    "part_number": "PS11752991",
    "title": "Refrigerator Door Cam WPW10329686",
    "installation_text": "The Door Cam is a black plastic part which helps the door pivot shut while keeping the door and hinge in proper alignment. Lubricating this part upon installation may help it move easier. It attaches onto the door hinge and should be replaced if broken or if there is noticeable damage. Refer to your model number and user manual to ensure this is the correct part for you. To do this repair you will need a 5/6 nut driver, a 5/16 socket, and a ratchet. For safety purposes, do not forget to turn off your appliance before making this repair. Note that this piece is black, and as per the manufacturer requires a new screw to mount the door cam which is sold individually. Please also note that this is the closing cam for the lower door, and the upper door cam is sold as a separate kit.",
    "url": "https://www.partselect.com/PS11752991-Whirlpool-WPW10329686-Refrigerator-Door-Cam.htm?SourceCode=18",
    "id": "PS11752991-install"
  },
  "PS10065979": {
    "part_number": "PS10065979",
    "title": "Upper Rack Adjuster Kit W10712395",
    "installation_text": "This OEM Dishwasher Upper Rack Adjuster Kit is a grayish-black, plastic part which will require a screwdriver to install. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. It also helps to adjust the height of the upper rack. If your dishwasher rack is not sliding properly, is falling off the track, or you are unable to adjust the height of the rack, then this part may need to be replaced. This part is sold as a kit and includes both the left and right adjusters. To complete this repair, you will need to remove the upper dish rack from the dishwasher. Then, you will need to remove the old adjusters by pulling them off the rack and sliding the new ones on. Please ensure that you have the correct part for your model before ordering, as parts may appear similar but have different dimensions. This part works with dishwashers.",
    "url": "https://www.partselect.com/PS10065979-Whirlpool-W10712395-Upper-Rack-Adjuster-Kit.htm?SourceCode=18",
    "id": "PS10065979-install"
  },
  "PS11756150": {
    "part_number": "PS11756150",
    "title": "Dishwasher Upper Rack Adjuster WPW10546503",
    "installation_text": "This OEM Dishwasher Upper Rack Adjuster is a grayish-black, plastic part which will require a screwdriver to install. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out smoothly. If your dishwasher upper rack is not sliding properly or is falling off the track, then this part may need to be replaced. To complete this repair, you will need to remove the upper dish rack from the dishwasher. Then, you will need to remove the old adjuster by pulling it off the rack and sliding the new one on. Please ensure that you have the correct part for your model before ordering, as parts may appear similar but have different dimensions. This part is sold individually and works with dishwashers. You may need to purchase two if both adjusters need to be replaced.",
    "url": "https://www.partselect.com/PS11756150-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.htm?SourceCode=18",
    "id": "PS11756150-install"
  },
  "PS3406971": {
    "part_number": "PS3406971",
    "title": "Lower Dishrack Wheel W10195416",
    "installation_text": "This Lower Dishrack Wheel is a white, plastic part that allows the lower dish rack to roll smoothly on the track inside your dishwasher. If your lower dish rack is not rolling properly, is making noise when you pull it out, or one of the wheels has broken off, then this part will need to be replaced. This wheel is sold individually, so you may need to purchase more than one if multiple wheels need to be replaced. To complete this repair, you will need to remove the lower dish rack from the dishwasher. Then, you will need to remove the old wheel by pulling it off the rack and pushing the new one on. Please ensure that you have the correct part for your model before ordering, as parts may appear similar but have different dimensions. This part works with dishwashers and requires no tools for installation.",
    "url": "https://www.partselect.com/PS3406971-Whirlpool-W10195416-Lower-Dishrack-Wheel.htm?SourceCode=18",
    "id": "PS3406971-install"
  }
}
